{"input_text": "I'm a female in my mid 20s. Lately I tend to over drink and I've become a very angry drunk.    In the past, I have even cheated on my boyfriend while I was under the influence of alcohol.    But now, even if I don't do anything wrong and don't embarrass myself, I still feel really guilty after a night of drinking. I don't understand why I'm feeling this way. Does this mean I have a problem?", "output_text": "Usually when someone asks if they have a problem, they believe they do have a problem!The first step is to understand your own theory and definition as to what problem you feel you have.  Some possibilities are feeling unhappy in the relationship to your boyfriend, not having enough discussion between the two of you, not feeling cared about by your boyfriend, not liking your boyfriend.Did you grow up in a family in which the grownups drank to the point of excess at the times they felt stressed?Family modeling of how to handle problems may have left you no knowing how to handle stress except to drink to excess.Ask yourself what it is you feel guilty of doing?The guilt may point you in a good direction if it is your sense of self-esteem telling you to find better ways of managing your life.Do you drink alone or together with friends?Try defining your specific reasons for drinking because this is the first step to know how to handle the situation differently."}
{"input_text": "I don't know how to have emotions. I never had any from my birth. Being human, I think of myself as a monster. I enjoy pain. I cut myself for my climax during sex. I think most of the time, I lie, even when sometimes it would have been easy just to tell the truth. I was in rehabilitation for four year. I have made love with both men and women, but it made no impact in my emotions. The books that I enjoy reading H.P. Lovecraft and Edgar Allen Poe. I go hunting every Saturday. I feel powerful. I don't enjoy the killing of the creature, but the hunt of it and to eat and drink the flesh and blood of the creature.", "output_text": "I'm not sure that you don't feel emotion or that you are frightened of the depth of your emotions. From what you write, the context of your growing up years had people telling you to not feel.  Little kids and babies don't remember whether or not they had emotions since birth.  This is information someone told you or was part of your family system.Possibly your family was afraid of their emotions or of you knowing yours.Similarly, your comparison of being human means being monster like, is not an obvious connection.  Besides, monsters are an idea, they aren't real.  They embody what someone considers the worst qualities of themselves or the human species.  Again, I wonder whether you've taken on stories you heard growing up about how unacceptable and bad you are.A way to start learning your emotions is to start in simple, basic ways to ask yourself what you are feeling in the situations that you believe emotions would belong.If on the first bright sunny and warm day of the year, you remind yourself to notice "}
{"input_text": "The birth mother attempted suicide several times while pregnant. The adopted mother was terminally ill upon adopting the baby and died when the child was just over one year old. The adopted father then remarried to a physically, psychologically, and emotionally abusive woman. The child was placed in foster care at 11 years old.    What might be the long term effects on an adult with this childhood history?", "output_text": "The true answer is, \"no one can really say with certainty\".The variables are the way this child absorbs and adjusts to these significant changes in their life.  All anyone can do is guess at this point and there's no good reason to guess.The only general certainty is that the adult whom this child becomes will have had a profound encounter with the biggest types of human losses a child can go through.Some people become great teachers, therapists and philosophers who have this background.  Some give up on life and hide away from others.The best anyone could do who knows this child is to offer love bc this is the greatest guarantee to show there are good people on this earth."}
{"input_text": "My daughter seemed to be developing at a normal rate until about the age of 10. She then started to act younger than she is.    Now she only wants to play with younger kids and she doesn't act her age. I don't know why this is happening. Is this normal?", "output_text": "Good for you to know your daughter's friendship circles and to notice when these have changed.While friendships are key relationships, they are not the only indicator of someone not developing normally.Is your observation and opinion that your daughter isn't normal based on other factors or just this one?If this is the only factor then start with reflecting on what circumstances may be influencing your daughter to socialize with younger kids.Has she ben ostracized or bullied by her peers and may be retreating to avoid further emotional hurt?Is she keeping up with her school work?Sometimes kids who feel overwhelmed by schoolwork will regress into conditions in which they feel more success and control.Are there family circumstances such as the death of someone with whom your daughter felt close?  Or, is there a new younger sibling in the family or a younger sibling who due to their own circumstance receives more attention than your daughter may wish for herself.Once you've reflected on which areas may be affect"}
{"input_text": "I have cheated on my husband of five years roughly ten times. I pretend we aren't married at my work. Recently, he has caught on, but I lie to cover it. He use to talk to girls online, but I have caught myself constantly having a affair.", "output_text": "Whether to divorce or not depends on your reasoning to do so.Marriage is its own unique existence dependent on what the partners want from it.Examine your terms of satisfaction from the marriage.Maybe you have very clear reasons to continue the marriage.Maybe you don’t.Only you can decide if what you’re contributing and benefitting is satisfying enough to stay."}
{"input_text": "I am broke, but I am sure I have been depressed for the past couple of years. I have always had anxiety. I just need someone to talk to right now. I don't have any friends or family I can talk to. I'm on the verge of just giving up.", "output_text": "Good question. There are resources out there - people to talk to. I'd try going to this link and calling the free 24/7 hotline: http://www.suicidepreventionlifeline.org/"}
{"input_text": "My motivation has gone away. It's hard to get out of bed. I really don't know what to do anymore. I'm miserable. My anxiety and depression have taken over my life.", "output_text": "Anxiety and Depression are challenging experiences to live with and to manage on a daily basis. I would say that both are challenges to overcome but solutions to living healthy and well exist. Step 1: Talk about it. With friends, family, partners, counselors, and other trusted people in your life. Step 2: Create a plan with a counselor to learn new skills that help you recognize and manage your symptoms. Step 3: Don't give up. Working on yourself can be difficult and hard at the beginning. Stick with it and you will be able to find exercises, tools, and resources that help you live well."}
{"input_text": "She said she needed space after three days of dating, and she got a boyfriend a week later. I still really miss her, and she told me she still likes me.", "output_text": "Given the short amount of time you know this girlfriend, there is no history on which to make a judgment about the likelihood of what she will do next.Certainly she is confusing by telling you she likes you and is with someone new.  And not giving you any explanation as to why she made her decision.I'd suggest two possibilities.Speak with her and ask her if she considers opening your relationship with her.Or, simply wait and see what she does when you contact her in a friendly way.Pay attention to your own satisfaction level.If you get more answers from her which aren't agreeable with you, then it is time to put the hope for this relationship behind you.Then you'll have clear space to find someone who is as interested in you as you are in them!"}
{"input_text": "I’m trying to make marriage work after a split. Before our split, he lied a lot and broke every promise to me. I don't think he cheated. Last month, I asked what women work with him, so he told me. Yesterday, I found out about a girl that he said he forgot about. Should I be upset?", "output_text": "In response to your answer. Yes because he broke a boundary of yours that he knew was important to you. The question that should be asked is are you able to go forward with your husband with his behaviors not changing for the better in regards to your feelings and emotions?"}
{"input_text": "My husband used a lot of negative words to hurt me, and I moved out. He is seeing a counselor and wants another chance to make things right. I'm not sure if I trust that he will not go back to his old ways.", "output_text": "I am glad he is seeing a counselor.  That is something that most men struggle with doing at times.  Time will tell if his actions are of good intentions.  However remember that a person can only do to you what you allow them to do in relationships.   What part did you play?  Did you down play his disrespect at one time?  Did you give up the power of your own voice?  Did you lose yourself in the relationship and it became just one sided?  Did you allow him to make you doubt yourself?   In others words, if you do decide to give him another chance, what would you do different?  Not saying that you are the blame or cause of the negative words AT ALL, but don't allow such disrespect from him or anyone else in the future.  If you do decide to give it another try, go in with a voice, with the demand of respect, with your needs and wants expressed and expected.  With an increase in your self worth and confidence, you will know what to do if his actions are true or if with dishonest intentions.   Seek counseling as we"}
{"input_text": "I started having anxiety three months ago. I'm new to having anxiety, and it's making me depressed.", "output_text": "I agree with Cory. Acceptance and Commitment Therapy (ACT) does seem to help a lot of people who struggle with anxiety. It's not the only type of therapy that can help, but it seems to help people in a way that is more natural and realistic. As Cory mentioned, anxiety is something that is part of life, so therapies that indicate we can get rid of it are questionable. Our natural inclination when we have anxiety is to STOP any and all things that may cause it or provoke it. We do this because we think it will help, but it actually doesn't. Anxiety usually has us rehashing the past or rehearsing the future while ignoring the present. ACT helps folks who have those kinds of tendencies. Be well..Robin J. Landwehr, DBH, LPC, NCC"}
{"input_text": "I feel that I need to end my present relationship. He lives three hours away and likes the reassurance of having someone to talk to multiple times per day and seeing me once or twice a month. I want someone who is more present and more of a life companion. Lately, he has had a very busy work schedule and I have only seen him a few times in the last 6 weeks. I told him that I can't continue in this way because I constantly feel frustrated and angry and that he is not making the relationship enough of a priority. I also feel it is keeping me from possibly finding the relationship I want. We have been together 7 years. The problem is that I panic and experience anxiety and depression thinking of him with someone else and then thinking I will never meet someone I like. We have gone through this cycle already 4-5 times and I feel it is unhealthy to stay in it, but my aversion to the anxiety and depression I experience upon separation always leads me to reconcile.", "output_text": "It sounds like you have some insight into the cycle that you describe with your current relationship and at the same time you are still feeling stuck. It also sounds like the distressing feelings that you experience, when you imagine what will happen for you and your current partner, are pretty overwhelming. A competent therapist may be able to help you work through these difficult thoughts and feelings and find a resolution to this cycle that will feel right to you."}
{"input_text": "I was born a girl, but I want to be a boy. Because of my religion I can't tell my family. I know they won't accept me. What do I do?", "output_text": "It is really important for you to be comfortable with your identity. With that said, it is also so important for you to be safe. It may be helpful for you to find supports (in your life, community, or online) that you can talk about how you feel and potentially gain supportive persons if your family does not accept you. It will be really important to connect with others and even a counselor to help you."}
{"input_text": "My partner lives in Canada while I live in the US. We visit each other, but we go months in between visits. I have anxiety, and I'm always anxious about him cheating or still having feelings for an ex that he dated for three years. He doesn't understand my anxiety. How do I stop myself from worrying so much?", "output_text": "Would you worry less if you and your partner had a plan as to when you will be together as a couple?Long distance relationships are not for everybody.   Some people need the daily or frequent interaction to feel secure.The question is not so much how to deal with anxiety that your partner is cheating on you than whether your own emotional and relationship requirements are satisfied with a long distance relationship.Anyway, cheating has nothing to do with distance since married people cheat while living together for years under the same roof!"}
{"input_text": "I broke up with him three weeks ago because I felt that he needed to be more respectful. He has since had a rebound relationship. He says he loves and misses me but refuses to see me. He says it's going to be too difficult to see me. Every time we talk, it feels like I'm being pushy to see him. He used to be so madly in love with me, but now, it seems like he couldn’t care less. I think I'm running him away.", "output_text": "Hi Kansas,I think your first instinct was good; you broke up with him. You deserve respect, but right now you're not acting as if you deserve it when you push to see him as he's moving on with a new relationship. It's appropriate now for you to respect that relationship and listen to what he says he wants, which is space. Do you think he's going to be any different with her? This a common, unfounded fear we have. I wonder if maybe you miss the feeling of being in love and having a partner more than you miss him. The bottom line is you can't make someone love you, and you can't make someone be loving towards you, because how someone treats you (and the choices they make) has everything to do with who they are, and nothing to do with who you are. I hope you gather support from others and move on in hope and strength for your own future."}
{"input_text": "Every winter I find myself getting sad because of the weather. How can I fight this?", "output_text": "Seasonal Affective Disorder (S.A.D.) is a term that reflects how many people are affected by the changing seasons, especially fall to winter.  Everyone suffers with some form of this (lessened activity levels, increased isolation, etc.) while some find that this time of year can put them into a deeper depression. If you have noticed that this happens frequently, there are some ways you can definitely help yourself going forward:1. Attend therapy to learn strategies and tools to help you to manage your mood.  It's important to stay within the therapy until you feel you have mastered these tools. 2. Push yourself to interact more with your social groups and other positive activities. It's easy to go out and spend the day outside in the summer months, when the temperature is warm and the sun shines for long periods of the day, but it seems harder to find fun ways to spend your time when the temperature drops and darkness comes on so quickly.  Perhaps winter time could become the time of year where you and your f"}
{"input_text": "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal.", "output_text": "Its hard to answer this question based on the information presented but I shall give it a go, Is it possible that your daughter is afraid of failing, I've seen many children and kids who get stressed out over grades or performance in sports, can you tell me \"what was your grade in fourth grade English? Or what was the score of the 7th game you played in football when you were a junior? Much of what happens to us is insignificant and we worry over things which really , in the long term don't matter much to us. But ask yourself this question, Is your daughters reaction to what is going grossly out of proportion with what would normally be expected, if the answer is yes, a visit to a psychotherapist might not be a bad idea to learn some coping skills and to alter our reaction to life."}
{"input_text": "I can't seem to feel any emotion except anxiety, not even for myself.", "output_text": "Thank you for posting.  I'm interested to hear some more information; such as, if you live by yourself or family, if you go to school/employed/unemployed, and what kind of things do you like to do with friends or by yourself.  Often times, when we are experiencing a strong emotion that we interpret as negative, we put most of our focus on that negative emotion and struggle to see that we do not always feel that specific emotion.  There are typically points in the day (even if it is for only in 1 minute intervals) when we do not feel that negative emotion.  When we overgeneralize, we use words like \"always\" or \"never\" and when we use those words and it may not be totally true, we feel the negative emotion based on an inaccuracy which is not fair to you.  Ask yourself some of these questions: Am I being realistic when I'm overgeneralizing things? Have I ever noticed a short period of time that I wasn't feeling anxious?  What do I notice when I am feeling anxious? What am I thinking about?  When was the last tim"}
{"input_text": "As I was growing up, my mother and father always fought. With that, I grew trust issues. I think it's going to affect my relationship now and end it sooner then I want to. I try not to let it affect me, but I can’t.", "output_text": "If you thing your trust issues are going to end or affect your relationship it will because you are being baggage from your parents into this relationship.  Don't allow their problems to become your problem.  You didn't mention that your partner in your present relationship have done anything to make you not trust them.  Like in the court of law, if no evidence....find not guilty.  Don't make them pay the consequences as if guilty of your parents unhealthy behavior."}
{"input_text": "My brother has been diagnosed with paranoid schizophrenia and has not been taking his medication. He's been using methamphetamine and alcohol and was found sleeping naked in my step mom driveway in 12 degree weather.\n   I was adopted in by his dad (who just passed) and his mother will not Get involved because she's afraid of financial responsibility.    Do I have the rights to be able to sign my brother into mentalhealth facility?", "output_text": "The answer depends on what State you live.Since the description you write here is that your brother may be a serious risk to himself and others, it is worth contacting a mental health hotline or one of your local area hospitals and talk to a social worker or other professional level person in their psychiatry department.  Ask the same question you posted here.   Your question is a good one and merits serious follow through."}
{"input_text": "I was raped a couple months ago, Since then, along with other unfortunately events that have occurred, I have been having trouble feeling emotions. It's almost as if I'm a sociopath lacking any feeling. What can I do to change this?", "output_text": "I am so sorry to hear about what happened to you! What you are describing is being in a state of shock. You haven't suddenly become a sociopath - this is a normal reaction to an event that is completely overwhelming. There are most likely too many feelings to feel right now, so your body in its wisdom is shutting them down. You absolutely can recover, and it would be really important to get some trauma counseling with a counselor who feels safe for you to talk with. This is not the kind of situation to try and handle totally on your own."}
{"input_text": "he just walks in the house whenever he wants to see his kids. My fiancé tells me it makes her angry and doesn't like it, but she seems afraid to say anything to him about it for some reason. Is it okay for him to do this?", "output_text": "The obvious answer is no, it's not okay.  There are other you should be asking though.  You said your fiance \"seems afraid\" of her ex.  Did you ask her about that?  Is there a reason he still has a key to the  home?  Has there been any discussion of appropriate boundaries?  I work with a lot of people parenting from different households and the stickiest spots are the ones that have not been discussed.  There is obviously conflict there or they wouldn't have split, but your fiance and her ex do need to stay aligned for the kids and that can't happen if she feels fearful or resentful.  If she doesn't have a problem with his barging in, clearly you do (and who wouldn't?  He's not YOUR ex!), so you and she need to have some agreements around his access to the home.  If she is afraid to bring up the discussion then I strongly recommend that she and the ex get some help with a good therapist.  The kids health, your health and hers, and the health of your relationships in the family depend on it!"}
{"input_text": "My husband cheated on me and it hurt me very bad. It was a time when my health was poor. I'm have a hard time moving on.", "output_text": "How has your husband acted since then? Was he regretful? How did you find out? Did he confess? These are all things that you want to consider. Betrayal is very hard to get over so if it's taking you awhile to get over, know that this is normal.Hopefully you're husband has been very regretful and upfront and honest with you since this happened. It may take awhile to reestablish your trust with him and he should understand this. It's also very important to discuss WHY he cheated. You want to make sure that the reasoning behind this was not something that could arise again in the future. And if it can, there needs to be an action plan in place (i.e. being honest with how he's feeling) so that you both get a chance to rectify the situation.If the cheating has happened more than once, you may want to reevaluate your reasoning for staying in the marriage. It would be obvious that he did not truly regret what he had done or else he wouldn't repeat the same mistake. However, if it was a single event and he has shown "}
{"input_text": "I was with my friends fishing by a pond. I found a frog and stabbed it with my friend's knife. I'm not sure why I did it. My friends saw me do it it and were shocked and got really mad at me.\n   Now if someone brings it up I get really upset and panicked. I don't know why I feel like this. Does this mean there is something wrong with me?", "output_text": "The good news is your awareness that being violent to animals feels out of character for you.   I'm glad you have awareness and I'm glad you are not at ease with killing frogs.Fairly likely that you were acting out aggressively toward the frog, feelings of being on the receiving side of similar type of violence.Basically, you did unto the frog what someone has or to you, feels like, has been done to you.Use your surprising finding of how strong your anger and most likely inward pain.   Reflect on your closest relationships and how these people treat you.   It is possible you feel more hurt by someone who is close to you than you ever realized.Stabbing innocent frogs is wrong.  It is understandable as a way to show you how much inner pain you probably have.It is also wrong that someone close to you hurt you.The direction to go is to recognize your pain and then decide how to go about changing what is possible on your side of that or those relationship(s)."}
{"input_text": "I'm going through some things with my feelings and myself. I barely sleep and I do nothing but think about how I'm worthless and how I shouldn't be here.\n   I've never tried or contemplated suicide. I've always wanted to fix my issues, but I never get around to it.\n   How can I change my feeling of being worthless to everyone?", "output_text": "It sounds like you are having some pretty severe depression. Depression can cause insomnia, and make a person focus on their own perceptions that they are \"worthless\". It is important to remember that other people may not truly perceive you as worthless. This is the depression talking.  I think that it is extremely important when you are this depressed, to sit down and write down some positives about yourself. What are your strengths? What are some positive things that your have done in your life? It concerns me that you are having suicidal thoughts. It sounds like now is the time to act on the idea of getting some help for yourself. If you feel like you might actually take your life, I would recommend that you go to a hospital emergency room, or a mental health crisis clinic right away to get some help. The most important thing right now is to keep yourself safe. If you are feeling like you are not going to hurt yourself despite your suicidal thoughts, I would recommend that you focus on finding a therapist "}
{"input_text": "How do you know you have the right therapist for you?\n How would I know how to \"train\" my therapist to be able to give me what I need from treatment?", "output_text": "How do you know anything is \"right\" for you? I think it's an intuitive process, and not always based on the objective expertise of the therapist, either (most psychotherapy research has concluded that the client-therapist relationship is the strongest factor in success in therapy.) But, in my view what is important to check-in with yourself around whether or not the therapist can hold space for all that you come in with (for example, not expressing discomfort with things you might talk about is a big \"run away\"), challenge you enough where you feel like it is challenging you to grow, but also where there is some part of you that does look forward to the sessions.How to \"train\" your therapist? This could be a session in and of itself I must say:) The therapist-client relationship can resemble many of the relationships in your life, or those that you seek out. A therapist, like anyone else in your life, won't be able to give you what you need 100% of the time and then expect that you will be able to function ou"}
{"input_text": "The last of my emotions belong to my pets. Today my dad said he might get rid of them tomorrow. If that does happen I might dig hole in the ground with a paper that says \"here lays my emotions. R.I.P.\" I practically have no emotions left and I came to the realization about this not being normal by comparing my reaction to certain situations to my family's. What's wrong with me?", "output_text": "It sounds to me like you have had a lot going on and now you are afraid you are going to lose the last things you care about, your pets. I do not know what all is going on in your family, and I cannot answer for your dad’s actions or his reasoning behind this.I would recommend that you focus on developing healthy coping skills. We cannot change what others do but we can change how what they do affects us. If you have all of your emotions and all of yourself tied up into one thing (like your pets) then when that thing is taken away it causes a lot of emotional distress. It is really good to have a wide variety of interests such as friends, hobbies, games, etc. Develop other things that you care about and are passionate about.Another reason for developing healthy coping skills to deal with whatever might be going on in your life is if you don’t have healthy ones, you may develop some very unhealthy ones. You have to cope somehow, right? Developing unhealthy ways of coping with life is only going to make life mo"}
{"input_text": "How do I decide if I should end my relationship with my boyfriend?", "output_text": "Previous counselors have discussed very good points about your situation so I would like just to confirm what seems essential to me on this topic. When you ask yourself this question, it shows you are not happy or have doubts about the way things have evolved so far. Relationships require time and work for them to develop, grow and flourish as healthy and fulfilling ones for both partners. This is a key factor, \"reciprocity\". Without both of you sharing the same core values, beliefs, expectations and lifestyles; without you having a good level of compatibility in your personalities and feeling understood, protected, cared by, supported and loved by each other, there is no way you could truly feel and experience a mutually healthy, meaningful and fulfilling relationship for the long run. What has attracted you to each other is good and meaningful enough to empower and support you for the long run? Many people focus too much on looks, financial benefits or other external factors, which are important but cannot "}
{"input_text": "My dad cheated on my mom for 13 years. I cannot stop obsessing over the fact that my boyfriend might be cheating on me even when I know he isn't. I have full access to his phone, social media, and e-mails. I never find anything, but I'm obsessed with constantly checking just in case. How do I stop this? It's driving a wedge between us.", "output_text": "Hi Greenville, I respect that you're owning your own overreactions, and that you want to give your boyfriend the respect he deserves. The truth is that some people cheat, and some don't, and our partners deserve the benefit of the doubt unless they show signs they can't be trusted.The answer here is in two different areas. Basically, if you want to feel differently (more trusting, in your case), you look at your thoughts, and your behaviours.Your thoughts are stuck... like tires in deep ruts in the road. These thoughts are only habits, they don't reflect the truth. Fear is probably whispering in your ear things like \"everyone cheats\", or \" you're not enough for him\". Once you figure out what fear is trying to tell you, picture those words in red next time they come up. Ask yourself what the evidence is that supports that thought (there won't be much...perhaps none), and what is the evidence that doesn't support it (I know lots of good men, I know I deserve love and loyalty, there is no sign of infidelity...)."}
{"input_text": "Does this go against any ethical codes? Are there legal ramifications?", "output_text": "Generally, the ethical codes only prohibit relationships with clients. There are however a few types of counselor-to-counselor relationships that are prohibited by the ethics codes. Such prohibited relationships include those between supervisors and supervisees; between professors and students; or any time the relationship might negatively impact your (or their) clients. Lastly, some workplaces have rules against dating coworkers. It would be a good idea to check if there is such a rule that applies to you."}
{"input_text": "I've gone to a couple therapy sessions so far and still everytime I walk in I get nervous and shaky. Is this normal? Should I still be feeling like this?", "output_text": "Well, it's generally okay to feel anxious or nervous about going into therapy, particularly in the beginning because the process of being open about what you are going through, much less to someone who you don't know well, can be anxiety-producing. It's also common to feel anxious when you are discussing something that is important, difficult to discuss, or you are making changes that are very difficult for you.The most important thing I can tell you, though, is to discuss with your therapist this idea that you feel nervous and shaky. Some anxiety can actually help to motivate or lead you toward change. There are also level of anxiety that can be counterproductive, so it's a good thing to discuss. Personally, I can tell you that I would want my clients to tell me about anxiety they feel 100% of the time. That opens the dialog to discuss whether it is the level of anxiety that they want to sit with and learn about in discovering more about themselves and their experiences and/or whether they would like to do s"}
{"input_text": "My husband doesn’t trust me for some past we had. I know all marriages have their ups and downs, but sometimes, I feel I am getting tired of the same thing over and over: that I am messing around, which I am not.", "output_text": "I'm sorry to hear about the trust issues in your relationship. Trust, as you clearly know, is essential to healthy relationships. Past indiscretions or dishonesty can damage this trust and make it really hard to confidence that these things will not happen again despite reassurances. We tend to be very sensitive to betrayal and risks to our relationship security. Rebuilding trust takes time and effort for both parties. On your end, you may need to provide more reassurance and more concrete evidence that you are trustworthy, gestures of transparency (e.g. - giving him more information about where you are going and who you will be with, letting him know when you get texts or emails from people that might give him pause or trigger insecurities), and more patience and empathy for his fears. On his end, he may need to learn to be with his insecurities and fears and ask for reassurance about your love and commitment in ways that do not lead to criticizing you, attempting to control you, or limiting your freedom. If"}
{"input_text": "After he got home from the hospital he was angry, then for a time wonderful. Now he is depressed and hopeless again.", "output_text": "Since as husband and wife your lives are closely joined, how your husband feels greatly influences the way you feel.Give yourself some time to concentrate on how you've been affected by your husband's suicide attempt.   Even if you decide against immediately telling him how you're feeling, knowing this about yourself will guide how and the topics you bring up with him.Is your husband talking easily with you?Do you have some ideas as to what is creating his feeling of hopelessness?The ideal approach would be if the two of you are able to discuss what bothers him and what bothers you.Depending on how far away you each are from such a position, you may benefit from speaking with a licensed professional therapist who can guide you and or you and your husband on opening up for discussion what feels stressful enough to merit taking one's own life."}
{"input_text": "I have so many issues to address. I have a history of sexual abuse, I’m a breast cancer survivor and I am a lifetime insomniac.    I have a long history of depression and I’m beginning to have anxiety. I have low self esteem but I’ve been happily married for almost 35 years.\n   I’ve never had counseling about any of this. Do I have too many issues to address in counseling?", "output_text": "You do not have too many issues to address in counseling.  And your perseverance will serve you well if you choose to engage in therapy.  The trauma and medical event you experienced topped off with chronic sleepless nights would lead to feelings of depression for many.  The emotional reaction you've had to these experiences sounds normal albeit troublesome and I would imagine intensely painful at times as well.  Therapy can help prioritize what is the most impactful issue you are grappling with.  I find in therapy that when the central issue is revealed, understood, processed, and understood again in its current context, many other areas of the person's internal experience improve.  It sounds as though something has prevented you from seeking help from a counselor in the past, and it sounds as though you are more seriously considering it now.  Therapy helps and it can help you when you're ready."}
{"input_text": "I just took a job that requires me to travel far away from home. My family and I really need this job.\n   People keep telling me I have \"anxiety\" and I'm terrified of having an anxiety attack on the road. This is all new to me. What can I do?", "output_text": "Bravo, on your success in securing a job and also for being proactive with your need. Starting a new job can be scary and having to travel away from your home and family can make it even more anxiety provoking. Do allow yourself to be anxious about this new journey, we can be hard on ourselves, think if it was a friend that was turning to you for help, what solutions would you have offered them, but also continue to seek to secure right support as well. Talking to your physician is always a good place to start; your physician can tell you if there are organic influences causing your anxiety that may be out of your control. Additionally, talking to close or compassionate family and friends is always good. It is important that you turn to supportive people at the time of emotional need, talking about our challenges can help break the cycle of anxiety at least momentarily. Remember, to further your success, it requires a healthy self, if you have supportive relationships relying on and turning to people who can "}
{"input_text": "It was over 20 years ago, but the pain has resurfaced again now because I have started seeing her Facebook posts about how great her life is. I feel so angry. How can I handle this?", "output_text": "First thing that you must realize is that most people only post the \"best parts\" of their lives on Facebook, some people even go so far as to make their lives seem better or more interesting and post mostly false views of their life. Facebook is watered down, candied version of our life, you put on there only what you want people to see. The questions you should ask is \"How have I grown from this?\", Is my marriage currently in a good place? I really wish there was some form of magic that could be performed to solve peoples issues and help them sort out their emotions and troubles, however there is not, the closest we can get is by using {time and insight} to heal our wounds."}
{"input_text": "How does a counselor decide when to end counseling sessions or to terminate working with a client?", "output_text": "It is usually time to end counseling sessions when it is clear to both the client and the counselor that therapeutic goals have been reached and enough improvement has been made that the client can continue without that support. There are exceptions to this rule, but for the most part this is when counselors begin termination. For some clients, this is an easy process that marks the achievements they have made in working through their emotions and difficulties. For some other clients, however, this is a difficult process in which they are losing a valuable support and are understandably anxious about what life will be like without the frequent meetings. Ultimately, termination is different for everyone, and there are many ways that termination can be healthy and helpful."}
{"input_text": "These \"jokes\" are made about everything. They seem to have the need to say something \"funny\" about everything. It's not funny, just awkward.", "output_text": "I agree, it is awkward when people make jokes about subjects which may not be funny at all.  And, if a person only jokes, then after laughing and realizing the person has nothing of themselves to offer, this can also be quite tedious.Realize that you are more aware of human interaction having many levels of expression.  You could start avoiding people who irritate you by the way they behave."}
{"input_text": "I have so many issues to address. I have a history of sexual abuse, I’m a breast cancer survivor and I am a lifetime insomniac.    I have a long history of depression and I’m beginning to have anxiety. I have low self esteem but I’ve been happily married for almost 35 years.\n   I’ve never had counseling about any of this. Do I have too many issues to address in counseling?", "output_text": "Absolutely not.  I strongly recommending working on one issue/need at a time.  In therapy you will set smart goals and objectives that will help you reach your goals.  I see you as a survivor and not a victim.  Best wishes to you."}
{"input_text": "I recently lost a friend to suicide. I'm smoking marijuana and drinking more to cope with it. How can I handle this better?", "output_text": "Let me begin by offering my condolences for your loss. I can understand how difficult this time maybe for you especially if you have several unanswered the questions due to the circumstances surrounding the death of your friend.  It's during this time, that you may experience the various stages of grief. This includes denial, anger, bargaining, depression and finally acceptance. In the bereavement process, there is so specific time frame or lengths of time for someone to work through each step. Its imperative to note  that one may express each stage with different levels of intensity. Also, the five stages do not necessarily occur in any specific order. We often move between stages before achieving a more peaceful acceptance of death. Just note that everyone greives differently, some internalize their feelings and emotions, others express it externally, while other avoid it all together.Coping with loss is ultimately a deeply personal and singular experience. Sometimes we feel that no one understands what we "}
{"input_text": "I'm a male in my 20s. My girlfriend is in her late 30s. She's great. She's funny and smart, she has a big heart, and we have an excellent sex life. She recently moved in with me partially because she wanted to and partially because she had no place to go. We fight a lot. It’s mostly my fault, I must admit. She doesn't like my insecurity and lack of trust I have for her. I have trust issues. Also, I can't fathom why a woman like her is with me, so I'm always dreading when a better dude will come along. I don't think she's happy. She's very submissive and she loves me very much, but also the fact that she has nowhere to go must be influencing her decision to stay. I love her so much, but my jealousy is not likely to diminish. I never believed in the whole \"If you love them, let them go,\" but I do now. I really want her to be happy. Should I end it with her? She has no place to go so I feel like I can’t break up with her. I’m literally trapped.", "output_text": "Are you possibly mixing up an impulse to nurture and protect someone, such as by offering housing, and your own need to feel loved and appreciated as a romantic partner?Maybe your feeling of jealousy is really your awareness of a reasonable need to be loved by a partner.Even though you are quite detailed in your description of your partner, one piece which is missing, is whether you feel you are loved by her.Maybe too, what she considers your insecurity, is really her unwillgness to love you.It's always easier to put distance between two people by insulting them.I hope this gives you a few new ways to look at your situation.A few therapy sessions, either by yourself or together w your gf, would give you more chance to know more deeply what it is you are facing."}
{"input_text": "I would like to be able to have more positive relationships in the present.", "output_text": "Would you describe yourself as sensitive to your surroundings and emotions?If yes, this may explain why letting go of past problems, is itself a problem.The dynamic of living one day at a time and letting go of past problems, is more imaginary and wishful than real.It is a popular notion of TV, FB, and media.Doing the letting go, has nothing to do with what is actually possible to do.Problems are not \"let go\", they are resolved somehow.Living one day at a time isn't possible for anyone who has consciousness.  No one can really disconnect from reality every day on which they wake up.Instead of trying to do the impossible which is promoted online and in media, allow yourself time to recognize what went into creating a problem in your life, in the first place.  Understanding problems leads to peacefulness and resolution.  Then you will have more freedom to make new relationships.Also, be patient with this process and yourself.If you have deep attachment to painful situations in your life, then possibly now is yo"}
{"input_text": "My fiancé and I broke up. He cheated on me numerous times. I kept forgiving but questioning his every move. He got tired and left.", "output_text": "Cheating on you shows a lack of commitment, in addition to the emotional hurt it creates.Probably you didn't actually forgive him because if you did, then you wouldn't have been asking questions of his every move.Maybe you were open to forgiving him.   In order for forgiveness to be effective, the person who has done the injuring must first show some understanding and empathy for the great pain the person caused in you.From what you write, your fiancé didn't seem to have much interest in earning back your trust or in empathizing with the way his cheating effected you.It is very likely his tiredness is also tiredness you feel, of having to watch him all the time.As uncomfortable as adjusting with the disappointment of him leaving you, the situation you describe sounds like it was unsatisfying for both of you."}
{"input_text": "As a child, my parents injured my brother, so they went to prison. I was there when he had gotten hurt, but I can't seem to remember. I also can't remember being with them quite well. It's a blur.", "output_text": "It's important to know that there are counselors who are trained in working with survivors of trauma and you can get help.  The \"blur\" in your memories is your brain's attempt to protect you from the experiences in your past.  To recover them can be a slow process done by a trained professional that you trust.  When you are ready and feel safe, those memories can be recovered and can be integrated with other memories.  This will help to lessen the potency of the memory, help to make sense of what has happened, and allow you to begin the healing process.  Check into therapist who are trained in EMDR (Eye Movement Desensitization and Reprocessing)."}
{"input_text": "He is always telling me our fights are only and all my fault, he bashes me to our young child, and he is addicted to a few substances.", "output_text": "The behaviors you describe are boundary violations.  You can not change your spouse, but you can respond to his behaviors in ways that protect your boundaries and ensure your safety.  This is very hard to do without support.  Finding a therapist who understands the dynamics of abusive relationships may be helpful.  If you are not ready to do this, I recommend the book \"Boundaries\" by Dr. Henry Cloud and Dr. John Townsend.  It's a great resource for helping one recognize boundary violations and learning how to respond to them in ways that are constructive!"}
{"input_text": "My girlfriend's grandma passed away 5 months ago. They were very close. She took care of her till she died. Things kinda returned to normal few weeks later. Last month it feels like we hit a brick wall. Intimacy fell off. I asked what's up. She says she can't connect with anyone and that it's not me. She used to be very open and expressive. Now she gives short answers and has no interest in sex or any touching. When we did have sex in the last month, something felt really off. Now I'm very insecure about us and have thoughts of her cheating. She says otherwise, but I don't know. It just feels like something is really off.", "output_text": "Grief has a huge impact on us and everyone's reaction is different. The one common reaction however is to shut down and distance ourselves. Her relationship with her grandmother was close, given she took care of her up until she passed. It sounds like she is working through a difficult loss and her ability to connect with you, or anyone else, is likely low right now. Trust what she is telling you and try to be there for her as she works through it. If she finds it too difficult to connect again, a good grief counselor can help her get back on track."}
{"input_text": "I've been experiencing a lot of anxiety and panic attacks lately. I was recently diagnosed by my psychiatrist with obsessive-compulsive disorder. Lately, I've been questioning everything from my career to my relationship. My boyfriend and I just moved in a few months ago. All of a sudden, I don't feel as comfortable around him as I used to, although I can't seem to find a reason as to why I feel this way.", "output_text": "Hi New Jersey,You talk about two very big changes in your life that have happened lately; the diagnosis/anxiety, and the moving in together. That's a lot!I love how you recognise that you been 'questioning everything'. I think anxiety's got its toe in the door and it's pushing you around, wanting some power over you. Fear and anxiety try to convince us that we need protection and that it's best to either pull away or fight. But letting anxiety control how you see your relationship isn't the answer here. I think you know that already.You must have moved in with him for a reason, and it's appropriate now to simply trust that, to ask him for some patience, and to focus on learning to manage the anxiety rather than questioning this decision to move in. Fear is getting in the way of you trusting yourself and your decision. You can figure the anxiety piece out while living with your boyfriend.When you're in a bit of a crisis is not the right time to make a major change. I suggest you use a therapist who works with "}
{"input_text": "I have so many issues to address. I have a history of sexual abuse, I’m a breast cancer survivor and I am a lifetime insomniac.    I have a long history of depression and I’m beginning to have anxiety. I have low self esteem but I’ve been happily married for almost 35 years.\n   I’ve never had counseling about any of this. Do I have too many issues to address in counseling?", "output_text": "Absolutely not.  I strongly recommending working on one issue/need at a time.  In therapy you will set smart goals and objectives that will help you reach your goals.  I see you as a survivor and not a victim.  Best wishes to you."}
{"input_text": "I recently lost a friend to suicide. I'm smoking marijuana and drinking more to cope with it. How can I handle this better?", "output_text": "Suicide is not a natural way to pass from this Earth, so many times it can be EXTREMELY tough to deal with because of the \"unnatural-ness\" of the event. We may find ourselves feeling guilty that we did not see it or that we could've have done more or something to stop it, but often the fish in the fishbowl cannot see that which is closest to him. You are currently trying to numb your feelings, those feelings as nasty as they are, are meant to be felt, those feelings help us to process the event and also help us to pass through the situation. Your friend has a legacy, remember it, and honor that legacy everyday in some small or even grand way, perhaps committing or volunteering your time to help others in honor of your friend.Hope this helps, C"}
{"input_text": "I had a very troubled up bringing and I'm currently dealing with alot right now. I know some people may not think so, but to me its a lot. I feel overwhelmed. Could this be depression?\n   I use to be in therapy as a child. Alll throughout elementry, middle, and high school I had counseling 2-3 times a week. I haven't be in counseling lately though.", "output_text": "What matters most is how you feel and what you're doing, with whom you're interacting, whether you feel you've got enough interaction to be happy.Whether or not a clinician would decide to identify you as \"depressed\" matters much less than how you actually are feeling, if you have some ideas as to what might improve your sense of being, and how to go about reaching your goals.If therapy during your childhood made you feel better and you feel you may be depressed, then trying therapy at this point in your life, makes sense.The worst that can happen is you find you feel better than you first understood.The best that can happen is you find a caring therapist who helps you find faith in yourself again."}
{"input_text": "How does a counselor decide when to end counseling sessions or to terminate working with a client?", "output_text": "As a therapist who believes in client self-determination above most other elements of the process, I want to as much as possible leave it up to the client to determine when they are finished. In the case of a termination because a client's distress has resolved, I might periodically check in with the client about how therapy has been going, and if we want to re-evaluate where we are.The more unfortunate situation would come about if I felt that I wasn't the best fit for the client. I would offer that in words, and ideas of therapists (with names) of who I thought might be a better fit and why. It still is up to the client whether to continue, however should they want to keep seeing me, a part of the work would be about that want (to see someone who professionally doesn't believe they can help as much as someone else.)I also find it perplexing when I hear a client (or on a personal level) tell me that their therapist said they \"didn't need therapy.\" I don't know that I buy into that scenario all that much, bec"}
{"input_text": "I'm going through some things with my feelings and myself. I barely sleep and I do nothing but think about how I'm worthless and how I shouldn't be here.\n   I've never tried or contemplated suicide. I've always wanted to fix my issues, but I never get around to it.\n   How can I change my feeling of being worthless to everyone?", "output_text": "People who feel worthless were, in one way or another, were told that they are worthless. This is the lie that they are living with. The work of therapy is to help people see their true good selves. This gives them self esteem."}
{"input_text": "After he got home from the hospital he was angry, then for a time wonderful. Now he is depressed and hopeless again.", "output_text": "It seems like you are very receptive of your husband’s emotions and want to support him trough this time.  But it is also important of being aware of your emotions.  How are you feeling after the suicide attempt?  It is common to experience negative feelings while you try to make sense of the incident.  Feelings like anger, shame, guilt and fear are frequent; while, wanting to avoid, minimize and become distant from the person are parts of the defense mechanism to attempt a quick resolution.  Once you understand and overcome those feelings you may be in a better position to help your husband; who may be experiencing some negative feelings as well.First, it is important to have a safety plan in place, which includes removing harming objects from the home, knowing who to call if there’s a new attempt (either 9-1-1, or nearby treatment center), have a professional expert who monitors you and your husband’s progress, either a Counselor or mental health provider could help you manage negative feelings and identify"}
{"input_text": "This is preventing me from getting a job. I have bad relationship with my bipolar mother. I am living with her but it stresses me out so much to be around her that I have locked myself in my room. I have no friends or other family to help me. I have no money for therapy, but I think I need therapy before I can secure a job.", "output_text": "A good first step would be to make an appointment with your primary care provider & discuss your concerns.  They would have resources available to help in your particular situation."}
{"input_text": "I am on the track and softball team. My school is small, so I play all four sports it offers. I feel obligated to do track because I'm not a horrible runner, and my dad wants me to. The catch is is that the days before a track meet and the morning of, I get sick and cry.", "output_text": "Does anyone notice that you get sick and cry on track meet days?Have you told anyone?From what you write, as much as you would like to please your school and dad, something within you doesn't quite want to fully follow through.Step one in life always is to know what you want and what your limits are.   It already is difficult to avoid listening to your body.Try understanding what is difficult in telling your father that you'd like doing as he wishes, only are not able to do so because you are emotionally and physically distraught on the days you have track.After finishing the season for this year with your school's track team, then expect to concentrate on taking care of your own need to not do track.Hopefully your father will understand and care about your problem.   If he does not and track is more important than your well being, then you have a different problem entirely."}
{"input_text": "Back in high school, my friend and I used to masturbate around each other. I hate even talking about it now because it's so weird. We didn't even realize how messed up it was at the time. One time, it escalated and we ended up doing it for each other. It wasn't supposed to be a gay thing, but it sure sounds like it now that I talk about it. I pushed this away until it recently came up in my head again. I'm having a lot of trouble.", "output_text": "Writing about your high school masturbation times with your friend, is itself a form of acknowledging the full picture of who you are.   You are doing well to reflect on your actions in the truthful way you are doing.Also positive is that you have perspective, that at your age and social maturity, you were innocently doing something that in adult terms, would be considered in a negative way.Maybe through your more mature mind's eye of today, you can feel some compassion and understanding for your high school self.  This way your sense of self-judgment may start to dissolve a little bit more."}
{"input_text": "I have terrible anxiety and depression. I've tried various therapists and pills, but nothing's helped.", "output_text": "I'm sorry that you have tried several different things and not had much relief.I will say that there are several different types of medications that may help and each therapist is different, so it is quite possible that a different combination of things you've already tried may be helpful.I would encourage you to continue trying different therapists. I would say to give each one at least six sessions before you decide that the approach that they are using is not working for you. Also, most places have a certain sort of structured initial session that must be done, but after that, the decisions are largely up to what you and the clinician feel is helping. If something is or is not working, communicate this with your therapist. This is a big deal. Most therapists I know actually welcome this feedback.There is a fair amount of research into the idea that the therapeutic alliance (the relationship that you have in the context of working through the reasons that brought you into therapy) is very important. Also, s"}
{"input_text": "I get so much anxiety, and I don’t know why. I feel like I can’t do anything by myself because I’m scared of the outcomes.", "output_text": "This is a very common question in my practice. Panic attacks typically emerge from an underlying issue (ex. Depression, low self-esteem, fears). To decrease your anxiety symptoms it’s recommended to seek treatment with a therapist who specializes in working with anxiety disorders and most importantly one with whom you feel comfortable with.In my practice I educate clients about their anxiety and discuss building a framework with helpful tools for decreasing anxiety:1. Starting a daily mindfulness practice. For example: listening to guided meditation; engaging in deep breathing exercises; yoga practice; or other positive calming activities.2. Understand your negative and positive thoughts. Many times we tend to focus on the potential for bad things to happen. Increase positive self-talk when feeling down or when anxious. For example: \"I don't need to worry, I am calm and relaxed\". 3. Exposure to fearful or anxious situations. This can be accomplished under the care of a mental health professional. Many times w"}
{"input_text": "I blame my past relationship for it. I know it is bad to be this way. I want to get past it.", "output_text": "We humans are social beings. We learn how to BE in relationship as children. The caregiving you received (or didn't receive) set the stage for how you show up in all your adult relationships. Insecurity in relationships often has much to do with feeling unheard or unseen, perhaps feeling like you don't matter. There are many ways to rewire these relational patterns, the first step of which is taking pause and noticing that you are feeling insecure - so congrats on that because clearly you are already there!  Next I'd suggest finding a relationship therapist to help you sort through your insecurities, either as a couple or individually."}
{"input_text": "I feel like every time I do something someone asks me to, I never fully meet what they want. I feel that when I finish it, they always think that they should have picked someone else to do it. I feel like they just want nothing to do with me.", "output_text": "As long as you try to reach others expectations you will never feel satisfied or accepted.  How about setting your own expectations for self and strive for those.  Make sure your expectations are reachable and realistic."}
{"input_text": "I have so many issues to address. I have a history of sexual abuse, I’m a breast cancer survivor and I am a lifetime insomniac.    I have a long history of depression and I’m beginning to have anxiety. I have low self esteem but I’ve been happily married for almost 35 years.\n   I’ve never had counseling about any of this. Do I have too many issues to address in counseling?", "output_text": "Yeah, you might :)At least, it certainly feels like that, I bet...Not to mention that most counselors out there might generally feel overwhelmed with a \"case\" with so many problems.  And, so, you will slog along week-to-week with gradual improvements occurring as she slowly does her best to chip away...The real issue is that these folks don't yet comprehend the integrative nature of each of these subjects and how generally simple it is to understand them, and then eradicate them."}
{"input_text": "Does counseling really do anything that can help people?", "output_text": "Counselling offers a number of ways to help one to improve their situation.  For some, this process can take a very long, winding path of self-discovery, while, for others, they are seeking a purposeful, solution-based way to approach and manage a specific problem. It's important to remember that there are different styles of therapy, some of which will work great with some, but poorly with others, specifically to help those to decide how they wish to move forward. I often recommend speaking with a number of therapists before beginning treatment to find out more about how they practice, in order to make sure their style aligns with your goals. On a more specific note, there is myriad research out in the world that indicates both counselling and medication can have an affect on changing our moods and behaviours.  However, medication is not an effective way of treating the problem, as it treats the symptoms of that problem (increased anxiety, lowered mood, etc.) and research has shown that the most effective ro"}
{"input_text": "She constantly tells me what I am doing wrong. For once, I want her to be proud of me. It’s like no matter what I do, she does not have one nice word to say to me. She is always hateful towards me and always has been.", "output_text": "I imagine this is very difficult and confusing for you.It sounds like there are things for which you are proud of yourself, which is really good. I hope there are also other people in your life that are currently able to recognize the good things that you're doing.If you think your mom would be willing to go to see a local mental health professional with you, that may be a good place to have some discussions about the relationship that the two of you have. The reason I'm suggesting that it may be easier to have the conversations there is because sometimes the mental health professional can point out parts of conflict that are not easy for the people who are involved to actually see by themselves.If you want to try to talk with you mom to see how she is feeling, maybe she would be willing to discuss it with you. If you're going to have a conversation like that, I would suggest you try these things:Ask her if this would be a good time to have an important conversation. If she says no, consider asking her when w"}
{"input_text": "I have been with a guy for 4 years, he's a great guy and we also have a son together. The problem is that I'm in love with a guy that I've been talking to for about 2 years but I've never met him in person. Honestly I'm bored with the relationship I have with the first guy and he makes want to go after the second guy, I don't know how to tell him that. What should I do?", "output_text": "Hi there. Wow, this sounds like a sticky situation; however, I’m here to help guide you through this decision. First and foremost, you must ask yourself, if you ever loved your sons’ father or was it a situation to where you two got pregnant and stayed together for the child. It’s very common to stay with your partner when a child is involved regardless, if love is involved or not because “it’s the right thing to do.” Right? Well, not entirely. Although, staying with your partner because you have a child together may seem right, in fact, it hurts the child in the long run. If you are not love with your partner, you will show distance, unhappiness, sadness, possibility of frequent arguments and cheating. When a child grows up in the home and witnesses these types of emotions & behaviors it is unhealthy as he/she will expect their own relationships to be such. As a responsible adult, you are supposed to be there to shape and model the future for your child. Just remember, what you do, your child will model. Sec"}
{"input_text": "My wife is always accusing me of cheating and telling me that I'm doing things she finds disrespectful even when I don't mean it like that. For example, she gets offended when I call someone at work \"sweetheart.\" I wish I had a penny for every time she accused me of cheating on her. She doesn't, and never will say she was wrong. How do I get her to understand?", "output_text": "Here is the truth: You will never get her to understand! because that would mean changing her and we can't change other people we can only change ourselves. I would recommend to take the time to self reflect on what exactly it is that you are doing that is contributing to the mixup. You both have very valid feelings and those won't magically go away until you address the root problem (which could be many factors). I am curious to know more about past relationships the both of you have had and how that plays a role in your current relationship. Many times we don't realize how past relationships truly impact our current behaviors."}
{"input_text": "I believe it is wrong for men to look at inappropriate content. The father of my child has agreed to respect my beliefs. His co-worker sent him an inappropriate video. He got mad because he does not think he should tell his friend to not send him things like that.", "output_text": "It sounds like you are wanting to protect your child from degrading images and that is one of the important parts of the job of a parent. Although it is challenging to supply an answer without knowing the full situation, it might be helpful to have a more broad discussion about what you both think about the influences and images that your child is exposed to and what you think your role is in protecting your child. This situation is one about beliefs and values and could well be an example you can use for exploring your parenting roles in protecting your child."}
{"input_text": "About 5 months ago my ex left without fully explaining why. For me it seemed out of the blue. I don't miss her as much as I used to but I just don't trust people anymore, not even my friends who I have known since my childhood not even my family. I'm so terrified of being judged or dismissed. Instead of acting like someone else or putting on a mask of a personality, I've just shut down. I haven't felt that sense of comfort and happiness with myself since everything fell apart. I'm scared to because I don't want it to be taken away from me again. I feel like ever lesson I learn only last a day. I just don't know what to do. I'm working at a place I know I should enjoy. I'm keeping up with my creative passions: working out, eating healthy, etc. I'm doing everything the books say I should do, but I don't feel any different. I just don't know what to do.", "output_text": "Sounds like you need closure. I'm sure your doing your best to overcome this feeling but seem to be struggling with your own happiness. Trust God no one else. Give this some time and don't close yourself off to the world or the people who love you. Be open hearted and minded. And know that no matter what reason your ex walked out of your life, she missed out on how great of a person you truly are and may have had personal issues of her own."}
{"input_text": "I terminated my counseling relationship with a social worker several years ago. I am now realizing that I would like to begin counseling again. The social worker’s voicemail message says that he returns calls in 24 hours, but he hasn't called me back. I called him on the weekend and made it clear that I want him to call me back. Can he just ignore me?", "output_text": "Mental health providers should promptly return calls from current clients as well as from potential clients.  This is even true if the social worker (or counselor) is unable to make an appointment with the caller.  In that case the social worker should call you back to let you know that he is unable to schedule an appointment with you.In addition, mental health providers have an obligation to follow through with their own communication standards.  For example, if the social worker in this case has an outgoing voicemail message that promises returned calls within 24 hours, he has an obligation to follow through on that promise.All that being said, it is also worth remembering that mental health professionals are just people too. It is possible that he had an unforeseen emergency that kept him from from returning your call promptly.In the end, I agree with Sherry's advice. If you feel this social worker is not a good fit for you, you probably should trust your gut and find someone else who is a better fit."}
{"input_text": "I have so many issues to address. I have a history of sexual abuse, I’m a breast cancer survivor and I am a lifetime insomniac.    I have a long history of depression and I’m beginning to have anxiety. I have low self esteem but I’ve been happily married for almost 35 years.\n   I’ve never had counseling about any of this. Do I have too many issues to address in counseling?", "output_text": "Hi! Many people begin their therapeutic journey with histories just like yours and experience transformative shifts in their quality of life.  I hope you are able to find a counselor you feel comfortable working with and do the work if you feel called. Best of luck on your journey!"}
{"input_text": "How does a counselor decide when to end counseling sessions or to terminate working with a client?", "output_text": "It is usually time to end counseling sessions when it is clear to both the client and the counselor that therapeutic goals have been reached and enough improvement has been made that the client can continue without that support. There are exceptions to this rule, but for the most part this is when counselors begin termination. For some clients, this is an easy process that marks the achievements they have made in working through their emotions and difficulties. For some other clients, however, this is a difficult process in which they are losing a valuable support and are understandably anxious about what life will be like without the frequent meetings. Ultimately, termination is different for everyone, and there are many ways that termination can be healthy and helpful."}
{"input_text": "Every time I send a message to someone or a group message on Instagram, iMessage, or snapchat people will read my messages but then they won't answer me.    Could it be that there is something they don't like about me? I don't understand why they won't answer my messages. How do I get people to respond to me?", "output_text": "Sorry to hear your friends aren't responding to you. If these friends are in-person as well as online, perhaps going to them in person and asking talking to them about your concern. Perhaps it's the way you send messages or the way they are receiving them. if they say no, then a simple request to respond to your messages. Measure the result and notice if there are even small differences. Also understand, why this is so important to you. Ask yourself, why it's so important for you to receive these messages from friends. What does it mean when they don't respond."}
{"input_text": "How does a counselor decide when to end counseling sessions or to terminate working with a client?", "output_text": "To be able to identify a clear ending to a counseling relationship, we must have a clear understanding of the goals and limitations of treatment.  Usually, during the initial evaluation, I identify my client’s short term and long term therapy goals.  As therapy progress, we verify goals on a monthly to a quarterly basis, depending on the frequency of the appointments.  Once the therapy goals have been met, there is a closing session, the counseling relationship is ended, and the client can stop attending sessions.  In some cases, the client can also establish new goals and determine if I am a good fit for their therapy needs or if they need a new provider, in which case I provide multiple referrals.The counseling relationship could also end due to other factors like noncompliance= when a client is not committed to the agreed treatment process, or when the client’s or a counselor violates the counseling relationship.  Either the counselor or the client is able to end counseling.  Although, as mental health pro"}
{"input_text": "I don't feel like myself anymore. For example, I could walk up an entire flight of stairs before realizing that my legs are moving. I feel like I’m watching my life be lived by someone else.", "output_text": "You may be experiencing a form of dissociation called depersonalization.  People with this type of dissociation may feel disconnected from their bodies, feel that they are watching their bodies from a distance, or may not recognize their image in the mirror.  Dissociation sometimes occurs after someone experiences something traumatic.  I would suggest working with a therapist who specializes in dissociative disorders as dissociation does not typically resolve on its own.  On my website, I have some information specific to dissociation that you may find helpful.  Best of luck to you."}
{"input_text": "My long-term girlfriend broke up with me recently. She says it's because of my anger.", "output_text": "I need help controlling my anger.Anger is like a blanket that contains other emotion from bursting out and serves as a shield to protect us when we are not able to manage external issues.   Anger also helps us understand that there’s something wrong that needs to change.  Once we understand that something else caused us to feel angry, then we can explore the source of anger. Ask yourself: Why am angry, Am I hurt, disappointed, confused, embarrassed etc.?  Once you find the answer, explore how often that happens and what’s your reaction.  Then explore how else you could respond or react.  You could use I-statements as a way to communicate your true feelings to your girlfriend or whoever is involved in the scenario.  This is a good exercise to practice with your Counselor or mental health provider because many unresolved issues may arise during this exploration, especially if you have been angry for a long timeAlso, it is important to understand the difference between anger and aggression and learn to manage ou"}
{"input_text": "I had to put a restraining order against my ex-fiancé. He was served last night. He was mentally and verbally abusive towards me. I thought it was my nerves, but every time I stand up, I get sick. If I sit and rock, I'm fine.", "output_text": "Hello, and thank you for your question. You may be right, your physical symptoms of getting sick to your stomach may very well be your nerves or anxiety. That is totally normal and understandable given your circumstances. Another thing that is not unusual is that you feel better when you sit and rock. That is actually a fairly common way that many people comfort themselves in times of high stress. If you are concerned that there is an actual physical illness causing these symptoms, you may want to visit your primary care provider. They may tell you that they don't see anything physically wrong with you, and at that point you may want to visit a counselor about the symptoms and your relationship experience. A visit with a counselor may be a good idea either way. I work as a counselor in primary care, and I promise you that many people have very real physical symptoms when they have gone through abuse. Unexplainable stomach and headaches are very common. Sometimes, with counseling, those physical symptoms actua"}
{"input_text": "My doctor seems to think I am in danger of having one. I neglected to ask how this was different than an episode. I have been formally diagnosed with bipolar type 1.", "output_text": "I do not think there is such a thing as a psychotic seizure, however, there is something called a pseduoseizure or psychogenic non-epileptic seizure. Basically, this is when a person shows signs of a full-on seizure (such as falling and convulsing) but they are not producing brain waves consistent with a seizure. Psedoseizures tend to be brought on by high stress, emotional challenges, and trauma history. You can learn more here, https://www.ncbi.nlm.nih.gov/books/NBK441871/ Still, the best way to now what your doctor meant would be to ask them! :)"}
{"input_text": "I'm depressed often, and my mind goes a million miles a minute. Every once in a while, things are okay for a few days. After a bit, I start noticing that I am picking at my skin profusely. After roughly a week, the anxiety is back and still picking. Sometimes I find myself causing fights to have change.", "output_text": "One way to know yourself a little better and why the dynamics you describe take place, is to understand the particular dynamics of your life context.Look at your major areas of where you spend your time, whether you are happy with the people with whom you socialize, how you feel toward family members and how they seem to feel toward you.If you examine your relationships and life this way then you may start to notice areas where you have some control or at least a say in how your life is going.If you are socializing among people whom you don't like, have a job you don't like and your family mistreats you and you mistreats them, for example, then anxiety and depression are an understandable natural result.If you make improvements in your life and relationships, even tiny improvements and even the effort and intention to improve, you may find your anxiety and depression dissipating.People usually feel their worst when they feel lack of control in their life.Look for ways you can regain and/or strengthen yours."}
{"input_text": "I have so many issues to address. I have a history of sexual abuse, I’m a breast cancer survivor and I am a lifetime insomniac.    I have a long history of depression and I’m beginning to have anxiety. I have low self esteem but I’ve been happily married for almost 35 years.\n   I’ve never had counseling about any of this. Do I have too many issues to address in counseling?", "output_text": "Absolutely not! It is never too much. The most important thing is that you are reaching out to get help.  Therapy helps you to develop healthier coping strategies and that can help reduce the anxiety and depression as well as improve your sleep. This can all be done at a pace that is best for you. Your therapist can help you process all of this in a safe and supportive space."}
{"input_text": "I found out my boyfriend takes anti-depression medicine. Lately he's been saying he has a lot on his mind, and he needs time to think about us. We've only been dating 3 weeks but I like him a lot.", "output_text": "Give him the time and space he needs.  Obviously something is going on with him that he needs time to process, think about, and work through.  Respect that most men are not talkers but more thinkers.  If and when he is ready to talk, he will.  When and if he does talk, be a comforting listener and put yourself in his shoes the best you can to be the support he needs.  Don't take it personal because you just been dating 3 weeks and his depression maybe something that been going on for a while.  If you do like him...showing him by being patient and supportive at this time."}
{"input_text": "I never feel like myself. I can’t even think straight anymore. I start stuttering and I can’t remember anything. I always get nervous and usually talk myself down but recently end up fighting with, what feels like, someone else. I don’t know why I feel this way, but I hate it.", "output_text": "Hi Houston, Okay, something's definitely going on, right? My gut is to start with your family physician, because you have some physical symptoms. While it seems anxiety is a likely problem here, your doctor will hopefully know your history and can help you decide if you need some medical tests or some therapy. Without knowing more, that's all I can say at this point. Best of luck."}
{"input_text": "I am in my early 20s and I still live with my parents because I can't afford to live alone.\n   My mother says that if I live under her roof I have to follow her rules. She is trying to control my life. What should I do?", "output_text": "Hi!   I'm sorry you are having such a tough time with this situation.  I have worked with a number of young adults in their 20's who have had to move back home after college , or even stay at home through the college years.  Bottom line is that either way , it is so difficult when you are trying to discover who you are and what you want your life to be , to have to live at home.   I have even heard much older adults clients  say that when they visit their childhood home , they suddenly feel like a \"kid\" again .  The old dynamics between adults and their parents and siblings can pop right up as if they have gone back in time and are no longer adults !I would suggest that you approach your mom and say something like \"I am hoping we can talk about the best way for us to manage me living here.  I really appreciate that you are giving me a place to live until I get on my feet , and I want to be respectful of you and our home ; at the same time , though, I feel like it's important for me to have more independence t"}
{"input_text": "I didn't trust my wife when I found out that she had a new guy friend that she was texting and calling. I investigated him before I found out that he was gay and that there was nothing going on. Now all my wife and I do is fight about trust.", "output_text": "Instead of fighting about trust, is it possible for you and your wife to talk with other about areas which upset each of you?Whenever feelings are hurt, knowing what exactly is problematic and being heard and understood by the partner, goes a long way to building trust.These type of discussions are hard to have, and especially for the first time.  A lot of emotions arise and often people lose their conversation focus from this.If you and your wife have a tough time opening up to each other, consider scheduling time with a couples therapist.Just by each of you committing time to invest in the relationship will show faith in the relationship, and this may contribute to restoring trust."}
{"input_text": "A year ago, the love of my life left me and never looked back. Our son was two months old at the time and it broke my heart. I miss her so much and can't seem to get over being so heartbroken.", "output_text": "Who takes care of your son, is a significant part of getting over your heartbreak.If you made reasonable custody terms re your son then the relationship heartache is much easier to recover from than if your son’s mother vanished from his life, or if the mother wants nothing to do w him.Re the actual relationship, let yourself feel sad and hurt since this is the truth.Usually life gradually fills in new people, including a relationship once you feel strong enough from having endured such sadness and loss."}
{"input_text": "I'm having relationship problems and I want to fix them to make things right before I lose her. How can I learn how to listen and get myself together?", "output_text": "Hard to say a whole lot without knowing more. However, if you focus your attention on her, what she's saying, what she's feeling instead of trying to make yourself heard and understood first, that's often a good step. Also, work on building win-win agreements with her, and follow through on them. Those are the areas I see men fall short on most often. Hope that helps!"}
{"input_text": "I have been dating my boyfriend for a month, and we want a baby. We don't work or drive, and we haven't talked to our parents. What should we do?", "output_text": "Hi Athens, When a teenager wants to have a baby, it's usually for a specific, and not healthy, reason. Do you maybe hope that a baby will cement your relationship? It doesn't work that way. Do you yearn for a person who will love you deeply? Babies don't give to us; we give endlessly to them. I urge you to talk to someone you trust about why you want to speed up your life by being a parent before you are fully grown emotionally. A relationship that is one month old is not stable enough to support a change like this. You're only starting to get to know each other. I wish you well and hope you talk to someone."}
{"input_text": "I don't know what to say. I have never really known who I am.", "output_text": "This quiet wonder that you have is something you can easily explore. There is a part of you that you can access anytime, anywhere. It is the part that has always been with you. Find a quiet place where you can be alone for a while and get comfortable. Settle in. Let your thoughts go by like a river. Stay with that connection for a while. What you find in the silence is yours alone, your \"you\"."}
{"input_text": "My boyfriend says I'm nuts. I need to get help because I get an overwhelming feeling that he is cheating on me. Whenever I try to talk with him about it, he always turns it around on me by telling me what I'm doing wrong. I know that accusing him does not help. When his whole demeanor shifts towards me, I can't help but think that something is wrong. Am I wrong for feeling this way? I try to talk with him to make it better. I let him know when I am feeling down. But I am not confident in these things.  Two weeks ago a girl texted his phone 3 times trying to hook up with him. He texted her back with \"Sorry, I've been working. I just read your message.\" The girl was trying to get him to call her at a time when he was at home with me. He texted her back with \"Don't text me anymore.\" I don't feel like I am way out of the line. But I can't talk with him if all that he will say is that I'm crazy and I need help. What should I do? How will I go about checking if there really is something wrong with me?", "output_text": "Trust your intuition that your boyfriend is involved with other people.You gave examples which strongly suggest this.Quite commonly, a person twist someone's words to convince then of having problems in seeing or understanding their own and other's behavior.Your intuition is again working quite well in telling you that your problem is having a boyfriend who manipulates you, not that you're seeing things incorrectly.One way to check if you're totally misreading him, is to examine whether you feel similarly in other relationships.If no one else who knows you tells you that you're crazy, then this strongly points to your boyfriend twisting words so that you feel wrong.Also, a consult with a therapist would clarify the dynamics between you and your boyfriend.A therapist session would also allow you to think out loud in a confidential discussion, what to do with your newfound clarity!"}
{"input_text": "About two and a half months ago, I met a woman on a dating site. We went out on two dates, and then despite her original plans on how to pace and conduct the relationship, I ended up at her house on a the Friday night one week after our first date. We respectfully tried not to have sex, but after hours of trying to resist each other, we gave in and we had sex. After that, I slept at her house every night for almost two weeks. Then one day, she went to her family’s house on Thanksgiving and everything changed. Within the short time we were together, we got so close and serious really fast. We had finally found each other. We told each other that we loved each other all the time, even while we were making love. A few days after Thanksgiving, she told me that we would have to go back to her original plans of seeing each other much less frequently. I was very hurt and didn’t understand. Then another week later, she told me she couldn’t do it at all anymore. I was crushed!\n   A few days later, she tells me how much she’s missing me and “let’s get together for lunch” or something like that. Then about two weeks later, we finally get together one night and we were so hot for each other (in love, not just sex), but she confessed that the reason for the sudden distance was that the father of her very young child told her he wants to get back together and this totally messed with her. So for her child’s sake, she is now considering the possibility of allowing that to happen. She had told me all about him previously, and it is definite that she has little to no attraction to him, but she would do this putting herself in misery again for her child. Our love for each other is fully established and acknowledged, but she is torn and confused. She doesn’t even think it would work between them as she had to kick him out before for not fulfilling his role properly. I know she needs time, and all I can do is take care of myself. We have agreed to remain friends, and if this doesn’t work out for her, we will try again. I’m completely in love with her, and I’m in extreme pain.", "output_text": "Love doesn't hurt.Your description of the relationship so far, is that you are feeling a lot of emotional pain, alongside a deep attraction for this woman.In some relationships, the benefit of what draws us together with someone, is being able to learn more about our own deep sense of who we are, what we value and care about.This sounds more descriptive of your relationship than that it is a loving one.  Your descriptions are of the woman's life, parenting and relationship dilemmas, not about how much of an effort she is willing to make in her life so that the two of you are able to be together for the long term.Try distinguishing your wishes to be loved by this woman with what actually is taking place in everyday life.Being aware of how much love you'd like to give and receive, is valuable self-knowledge.Your ongoing emotional wear and tear of all decisions about the relationship that affect you, being the result of the woman's choices, sounds like the opposite of love.The relationship is very useful as an a"}
{"input_text": "How do therapists classify the type of personality their clients have? What characteristics do they look at to decide what type of personality the client has? I've read about this online, but I'd like to understand this from a therapist's point of view.", "output_text": "Not very well :)So, you got the Jungians, and you got the Big Fiver's, and you got every manner of Ivory-Tower Orc in between, loosening the chains on their drooling, snarling Pet Theories...The real truth is, does it matter?  If it does, what does it matter?If it's still of keen interest to you, I would presume that God designed most of his creatures with a \"simpler set\" of personality blueprints; not a complex set as theorized by man;Also realize that this level of reality is dualistic in nature; that means there is two of everything;So, imagine that whatever personalities you observe, and whatever words come to mind, also think of the opposite word, and you'll have a good sense of what actual personalities look like :)Then, share your findings; it'll be pretty neat to see what you come up with."}
{"input_text": "How do you know you have the right therapist for you?\n How would I know how to \"train\" my therapist to be able to give me what I need from treatment?", "output_text": "Finding the right therapist can be difficult, especially if you've never tried it before. Things to consider are location, availability and what specifically are you looking for. Some practitioners specifically only work with a certain type of issue (i.e eating disorders, adolescents, anger management, life transitions, anxiety...etc) and others can work with a variety of concerns. As far as training your therapist, you can't. You simply let them know what you are looking to work on or what you think may be an issue for you. Depending on the way they practice(their style of working with clients) is how they will then decide to make a treatment plan that works best for you. You can always ask them their specialty practice population, the problems they generally help others with and what type of mental health provider they are (Psychologist, social worker, licensed mental health counselor)."}
{"input_text": "I'm a male in my early 20s. Lately, my paranoia about being around kids is causing me too breathe heavy and sweat a lot. I then start to act weird because I'm trying to fight my paranoia. This leads to people starring at me because they don't know that I'm suffering from panic attacks and paranoia. They just notice me acting scared around kids and they think I'm a threat because of it.    I'm not a pervert or predator. I would never hurt a kid. I like kids and don't know why I'm so scared to be around them.    I don't understand why I feel like this. Am I a bad person? How do I make this stop?", "output_text": "Your question is written in a very sincere tone.   This, together with the fact of searching for self-understanding, sound more like someone who is unsure and puzzled, not someone who is \"bad\".What was your own childhood like?The sensations you describe feeling sometimes occur in people who are reminded of very deep hurts from during their own childhood.Is it possible what you're feeling is from being reminded of great distress you lived through when you were at a similar age as the kids around whom you feel this sudden and great paranoia and fear?"}
{"input_text": "I am a really shy person. I'm currently in a graduate program which requires lots of presentations, but they always make me feel stressed out and less confident. How can I get more confident?", "output_text": "First of all, way to go in stretching yourself out of your comfort zone! You are sure to grow through all of this practice presenting to your peers, and that in itself will help to grow your confidence over time. In the meantime, do whatever you can to help yourself feel prepared for each presentation. Do your work ahead of time so that you feel well-informed on your topic, and then spend the days leading up to your presentation practicing. Do your presentation in the mirror, while you are driving (if it won't distract you from the road), and practice in front of a friend. On the day of the presentation, eat a balanced meal, get a pep talk from a supportive friend, use deep breathing to keep your body calm, and remind yourself that you are prepared. You got this!"}
{"input_text": "I'm going through a divorce with my wife of three years, who I've known since the 4th grade and been involved with for seven years! We just had a baby seven months ago and never got along with my mother, who I've lived with for years. I am now back with my mother because I have nowhere to go with this divorce looming. I'm heart broken because I fell into a depression, I haven't seen my child in a while, I'm having good and bad dreams, and I feel hated. Can you help? Can you intervene? Can I speak with someone?", "output_text": "It's hard to accept the end of a marriage when it's not your choice; you feel powerless, abandoned and unwanted. Your wife has the right to decide not to be in a marriage with you, and a therapist can help you accept and move through this change that has broken your heart and left you lost. You don't indicate why you haven't seen your child, and you may want to consult with a lawyer about the laws in your area and how to gain access to your baby. Therapists don't intervene in these ways. The marriage may be ending, but your role as a loving father is only beginning.  You can focus on giving your child the gift of two parents who respect each other."}
{"input_text": "I've been with a man for four years. For the last year, he has said he is done, but he still talks, texts, visits, and has not moved on with anyone else. His words do not match his actions. I love this man, but it's hurting so much.", "output_text": "If I understand you correctly, this \"maybe-boyfriend\" has done a partial break up, and wants to maintain a partial relationship.  Is that ok with you?  And, if it is, what does it cost you?  He says he's \"done\" but still wants the connection.  That seems to leave him free to explore other options, but it doesn't allow you to do the same.  Break ups are painful, and I know you'd like to avoid that.  I get it that you feel attached to him - you have been in a relationship with him for 4 years, so that makes sense.  However, loving him appears to be costing you a lot, without much in return. If you wait for him to define what he wants, you could be on hold for a long time.Please don't wait another year to advocate for yourself.  See a therapist who can help you figure out what you need out of relationships and why you have allowed yourself to be on \"pause\".   It is possible that once you get clear, you will be able to have a true relationship with him.  If not, please don't settle for this.  Take good care of yo"}
{"input_text": "I get so much anxiety, and I don’t know why. I feel like I can’t do anything by myself because I’m scared of the outcomes.", "output_text": "Anxiety is simply your system communicating to you that you are in danger. The issue that I see in most of my clients is that they try to reason with this anxiety. You do not reason with sensory states in the body. If your system tells your in danger (your stomache feels like it is knots, your heart is beating out of your chest,) validate by just being present with it. Take your breath to it. Breath in and out of that space. Say ok, I am in danger. I always tell my clients, \"a crying baby wants to be held, not told to shut up.\" Listen to your system, validate it like you do a child and see what happens."}
{"input_text": "I was raped a couple months ago, Since then, along with other unfortunately events that have occurred, I have been having trouble feeling emotions. It's almost as if I'm a sociopath lacking any feeling. What can I do to change this?", "output_text": "I don't need to tell you that this is an incredible amount of serious stuff to happen in a short period. When we go through a trauma, it is natural for us to shut down as a way to protect ourselves. A kind of freeze response. Think of a possum or a gazelle. These animals go so far as to physically freeze in protection. Our emotions do the same thing sometimes. We feel shut down and that can be strange---a kind of disconnection. This does not mean that you are sociopath or that your feelings will never come back.  The amazing thing though is that as time moves forward we naturally heal and emotions come back. If you feel stuck, seeking counseling is a way to help accelerate this healing and help you work through and begin healing. Wishing you the absolute best!"}
{"input_text": "My husband and I have been together since high school. We have been married going on for nearly ten years, and we have three beautiful children. A few weeks ago, my husband decided he need some time apart and moved over to his dad’s for a while. He comes home to see the kids and acts like there is not too much wrong. Can this marriage be saved or is it too late? He said he would go to counseling, so I don't think he has given up.", "output_text": "While it would be impossible for me to say whether your marriage can be saved it sounds like you are both willing to give it a try and to get professional support. With appropriate professional support for your relationship a lot is possible. I'm not familiar with the resources available in Jackson but I'm sure there are some good local couple therapists and there may be some agencies that specialize in couple counselling and family therapy. So often the challenges that we have in relationships result from rather small habits in relating that lead to greater feelings of distress, loneliness, anger and resentment. I commend your willingness to put effort into creating the strong loving relationship that you want for both of your sakes and of course for your children. The following links provides more information regarding common behaviours that predict staying together or separating and also videos and other resources that can help you get started. Wishing you and your family all the best on your journey of he"}
{"input_text": "I have been experiencing a lot of sexual tension with a lot of the guys that I talk to nowadays. I keep imagining having sex with them. I have never had sex before, nor have I had a boyfriend. I feel lonely and empty. I feel like my body is not okay, and I am missing something. I talk to so many boys in school, and I always fantasize about half of them. I want this feeling to stop because it is interfering with my time to study since most of the time, I am busy thinking about sex.", "output_text": "Hi Montreal, I'm glad you wrote. What you're experiencing is normal. We're sexual beings. We have a built-in desire to connect sexually with others, because it feels good, to keep procreation going, and mostly to \"connect\" with other people, because connecting with others makes us feel fulfilled and valuable. Sexual desire is a healthy part of you. Maybe your body is telling you it wants to dive into that water and taste it instead of just staring at it? It sounds like you're beginning to explore yourself sexually, and that's okay.At your young age, you also have another innate burning desire, and that is to know yourself. I see both of these desires burning and competing in you. It's a bit of a crazy time...you want to connect with others but you're not sure who you are or what you want from them. You want to know yourself but you can't learn about yourself in a vacuum. It's okay to trust your instincts. It's okay to connect sexually with others, as long as you're preventing disease and pregnancy and you kno"}
{"input_text": "I'm transgender, I know I am, but I've only told a few friends. I know I can't tell my family because of previous conversations we've had. They just wouldn't accept it.\n My gender dysphoria is getting really difficult to deal with on my own. I need some strategies for dealing with it. What should I do?", "output_text": "Hello, and thank you for your question. I am so glad that you reached out for help. I know that the dysphoria can feel nearly impossible to handle, especially since you have limited support from people who accept who you are. You may already know some of these resources, but I am going to share a few. 1. The website www.letsqueerthingsup.com is a blog from a very good writer that I know. His name is Sam Dylan Finch, and he is transgender. He writes about mental health, transgender issues, and many other topics. I know he has frequently written about gender dysphoria and ways to manage it. You may want to check out his site and do a search on there. 2. The website www.everydayfeminism.com employs many transgender writers and several have written about gender dysphoria and have given ideas for managing it. If you search for gender dysphoria on their site, many articles pop up. It may be a good resource for you, especially if you ever feel lonely and start to forget that there are others out there who are like y"}
{"input_text": "I’ve been on 0.5 mg of Xanax twice a day for the past month. It hasn't been helping me at all, but when I take 1 mg during a big anxiety attack, it calms me down. I was wondering how I can ask my psychologist to up the dose to 1 mg twice a day without her thinking I'm abusing them. I just have very big anxiety attacks. Should I stay on the 0.5mg and deal with the attacks or should I ask to up the dose? I'm afraid she will take me off them and put me on something else.", "output_text": "Hello, and thank you for your question. While counselors work closely with medical providers, and sometimes have discussions about medications with people, we rarely make recommendations about how much or what type of medication a person should be taking. This is because prescribing and advising on medication is out of our scope of practice. The only exception would be if a counselor is also a physician, nurse practitioner, physician's assistant, etc. Having said that, I certainly understand that anxiety is a real serious problem that many folks struggle with. If you are currently not in therapy to help you with these panic attacks, you should consider it. Medications can be helpful for anxiety, and medications like Xanax may help for immediate relief, but they do nothing to deal with the root of anxiety and may not help with anxiety long-term. Therapists who have experience in exposure therapies would be good people to start with. Exposure therapy has good outcomes for people with anxiety disorders and panic"}
{"input_text": "I would like to be able to have more positive relationships in the present.", "output_text": "Remember, the past no longer exists and the future is just an illusion as we don't know what will happen tomorrow, so take the present as your guide. That is all we can do, so keep saying this to yourself and try to help someone each day.  The happiness is helping others to feel a bit better."}
{"input_text": "After he got home from the hospital he was angry, then for a time wonderful. Now he is depressed and hopeless again.", "output_text": "I'm thankful to read your husband found care and that his suicide attempt wasn't successful.   While he was hospitalized, and prior to his release, your husband would've been provided in writing a self-care action plan. This typically includes things like committing to a contract 'not to harm' and what to do if he felt overwhelmed by his anger, depression, and hopelessness (e.g. call 911, call therapist, go to nearest hospital emergency department). Additionally, his protocol would've provided instructions for his taking medication(s) as directed, having a follow-up appointment(s) with his psychiatrist/psychologist/clinical social worker, and participating in some form of small group support.  If your husband's struggling as you describe, and you are feeling overwhelmed or frightened for his (your) safety, I'd encourage you to seek immediate assistance."}
{"input_text": "I'm depressed. I have been for years. I hide it from everyone because I'm scared of the reactions I'll get. Last time I tried telling my parents, it was a huge argument about me being too young to be depressed (I’m a legal adult), calling me ungrateful, and telling me that if I can't handle things now, it's only going to get worse in the future (which is turning out to be true). It's exhausting pretending to be okay, and I don't know how much longer I can try. I'm just really tired, and sadly, I can't afford the help I need on my own.", "output_text": "Don't think that you can't afford the help you need on your own.  There are several counselors that see people on a sliding scale that can be as low as $5 (based on your income).  Find a center that is non-profit, they have great counselors as well. It sounds like you know what you are experiencing and know that you need someone to talk to, someone that is willing to listen.  Your parents may not understand what your are feeling right now and that is not totally abnormal.I would encourage you to seek help immediately so you can live the best live you can...which is not being depressed."}
{"input_text": "I've hit my head on walls and floors ever since I was young. I sometimes still do it but I don't exactly know why,    I have anxiety and I had a rough childhood but now I'll start to hit my head and sometimes not realize it but I don't know how to stop or even why I'm doing it.    How can I help myself to change my behavior?", "output_text": "The best way to handle anxiety of this level is with a combination of appropriate medication given to you by a medical doctor, and therapy to help you understand the thoughts, feelings, and behaviors that are causing the anxiety. This is not something that anyone should just “white knuckle” and try to get through on their own with no help. Cognitive Behavioral Therapy is a technique that has been proven helpful for depression and anxiety. This takes a therapist trained in CBT. You will learn to recognize when and why you perform the behavior of hitting your head, help you deal with the underlying cause of this, and replace the behavior with a more positive behavior. You'll learn coping skills.You mention having a rough childhood. Anyone who has experienced trauma like this, especially long-term ongoing trauma from abuse of any kind, definitely does not need \"exposure therapy\", which is what is recommended for phobias. You need a therapist trained specifically in trauma informed therapy.You are on the right pa"}
{"input_text": "I've gone to a couple therapy sessions so far and still everytime I walk in I get nervous and shaky. Is this normal? Should I still be feeling like this?", "output_text": "Yes, it is completely normal to feel anxious about therapy. Therapy often explores topics and feelings that are uncomfortable. The ultimate goal of therapy is to feel better but the process itself can be uncomfortable."}
{"input_text": "I've gone to a couple therapy sessions so far and still everytime I walk in I get nervous and shaky. Is this normal? Should I still be feeling like this?", "output_text": "Hi there, Thank you for your question. It's absolutely ok to feel nervous going to therapy. I have experienced anxiety going to see my own therapist. There can be a few reasons why you might feel this way. First, it is always unnerving to see a person who is a stranger and to share intimate things with that stranger. You mentioned it has only been a couple of sessions. Your anxiety might subside as you continue to see your therapist and grow more comfortable with him/her. Another reason why you might feel particularly nervous is perhaps you are not comfortable sharing things. As children, we might have bad experiences opening up to others. Someone might bully or ridicule us, and that experience can stay with us for a long time, making it extra scary to share our intimate feelings and thoughts with others. If this the case, as you continue with your sessions and have positive interactions with your therapists, this anxiety will subside with time and you will re-learn that it is safe to share. And the last thou"}
{"input_text": "My dad is always, and I mean always, cussing and screaming at me for no reason at all. He makes me feel stupid. He also compares me to my other siblings in a negative way and demeans me. Is this abuse?", "output_text": "I'm really sorry to hear that you are going through this.It's a little difficult to answer your question because the laws that define child abuse are different from state to state. But usually, things like what you describe your dad is doing are not considered to be child abuse.The more important thing is how you feel about what is going on. It sounds like this is really bothering you.If you don't think you can talk to your dad about how you feel, you might want to try talking to another adult you trust (like a family member or teacher). They may be able to help you figure out some ways to communicate with your dad.I think you might feel better if you can talk to someone about how your are feeling."}
{"input_text": "I have family issues, and my dad was both violent and a cheater.", "output_text": "I can imagine how incredibly difficult this must be for you. Having past traumatic experiences creap up on you without warning can be very scary and stressful. You may be suffering from symptoms related to post-traumatic stress disorder. Getting evaluated by a professional would be a good step to take next. By seeking treatment and having a therapist who you trust and can connect with, you will gain the ability to think about your experiences without it significantly interfering with your daily functioning. A therapist can also help you to develop new coping stragies to be used during recall of these experiences and help you to adopt healthy thought patterns. I would also recommend that you seek support from loved ones. Sometimes just talking about your experiences and associated feelings will alleviate some of the emotional troubles you are suffering from. Lastly, you may find meditation or mindfulness work to be of great benefit. Having the ability to live in the present moment should reduce the effects of "}
{"input_text": "My husband and I have been married for seven years, and in that time, we have only had sex four or five times. Others have told me that most men would have left me by now. Honestly, I think I have a low sex drive or neither one of us actually knows what we are doing. I want to be better connected with my husband.", "output_text": "There are many different ways that can be approached in your situation.1. I would recommend a complete medical examination including blood test. i would want to know if there are any medical issues in your low sex drive.2. Where is your husband in this situation? Is he resentful, accepting, demanding or neutral?3. What is your past sexual history? has this had an affect on your current issue?4.Has there been problems in your past with abuse of any kind?5. Understand that intimacy is more than sex. What other ways can you be close to your spouse?6. It sounds like there is some confusion about sexual intimacy from both of you.Couples counseling would be a great place to start. All of these areas need to be explored before any treatment goals can be established.You need to talk with a professional counselor to explore how to better connect with your spouse."}
{"input_text": "She was raised by her abusive father and his wife. 30 years ago I shot and killed my rapist and was convicted in Louisiana. I lost custody of my daughter and served 5 years. When I was released, she was 5 and didn't remember me. Many many sad memories came from my having to leave her visit after visit, having to leave her in Texas to travel back to Louisiana. She doesn't remember that. I do. Over the years, I thought we had developed a close mother daughter relationship. She gave me good reason to doubt that on several occasions but especially last year. I have been cruel to her verbally and to my son who I met years after giving him up for adoption. Last night, I was angry at the world and afraid of God. I drank and cussed out a maintenance worker for not doing his job 4 months running. Now I'm not only feeling guilty for that but afraid of being evicted now. Help.", "output_text": "Was either parent abusive or violent toward you?You sound to have suffered emotionally in your relationships since early in life.One point to consider is to strive for moderation in what you offer in relationships.A lot of what you've lived through is extreme, either as victim or perpetrator.If you imagine that apologizing to the custodian for the way spoke to him, would calm him down, do so.At the very least, you'll be actively resolving your guilt over cussing at him, and fear of his retaliation."}
{"input_text": "I've been bullied for years and the teachers have done nothing about it. I haven't been diagnosed with depression, but i have been extremely sad for years.\n   How can I deal with being bullied at school when the teachers won't help?", "output_text": "That's a very difficult situation that you are in. But you are not alone. I have several school-aged clients who find little to no assistance from their teachers at their schools regarding bullying.There are a few options that are available to you to help deal with being bullied at school. One option that I would suggest is for you to talk to your support network. Friends and family can sometimes be good sources of support. Another option would be to speak with us about your counselor, if you have one. And third, there are some excellent online sources of support regarding the bullying at school (www.stopbullying.org)."}
{"input_text": "i was addicted to porn since the second grade. I'm in my early 40s and overcame my addiction during my separation from my wife of 15 years.", "output_text": "The person who can answer this question is the person you want to rebuild that trust with.  They are the only one who can tell you what it will take for them to trust you again.  What they tell you may seem hard or impossible but unfortunately that is what THEY need.  It is up to you if you feel and know you can provide what they request."}
{"input_text": "My girlfriend just quit drinking and she became really depressed. She told me that she wants to move. What can I do to help her? I want her to stay.", "output_text": "I would say talk to her about her depression. The best thing you can do is let her know that you are there for her as a support system. I would encourage her to talk more if it helps and encourage her to get move involved in doing activities she likes to do. Also, getting connected in a community of people is important to help with feeling depressed. Encourage her to speak with a therapist or counselor to address her depression as she has made a major change in her life by deciding to stop drinking. She may believe moving is the best to help with this. You can share with her that you want her to stay and express to her how you feel. Ultimately, you will have to respect her boundaries and the decision she chooses to make. She may want to move and this may be what she feels is best for her life. If she does choose to move that will be her decision. It sounds like she is trying to do what is going to make her happy. Maybe staying in the city she is currently in is causing her more feelings of sadness."}
{"input_text": "I am in a high stress position for a tech company. I am being overworked and underpaid for my contributions and it is not only giving me anxiety, but also demoralizing.\n   What can I do to manage my stress?", "output_text": "Ugh!  We spend so many hours at work, so if it's a tough environment it can really drag you down.  Is this your \"dream job\" gone sour or a \"just pay the bills\" deal that has gotten stale?  It makes a big difference in terms of next steps.For example, if this job is a step on the way to a bigger goal, it might be time to assess whether you need to be moving along to then next phase.  Have you learned what you needed to learn to make this a helpful experience?  Or do you sense there is more to learn, but you feel stuck in some way? If this current job is part of a bigger plan, then you need to practice some good self care, set up ways to remind yourself why you are doing what you are doing, and make sure you are including some \"carrots\" along the way.  That might mean spending some time each week networking (preferably live but online works well too) with peers in similar situations (entrepreneur groups, skill building trainings, etc).  Big dreams require small steps, but we all need support along the way.If , "}
{"input_text": "What are the basic skills a good counselor needs to have?", "output_text": "To be non-judgemental, know who they themselves are, be able to step forward and ask questions with ease and grace into painful emotional areas.Also to respect human difference in accomplishing basic life tasks and everyday living."}
{"input_text": "I have been with my husband for almost 7 years. We got engaged a little after 5 years of being together. I had always been clear that I wanted to get married and I sadly would drop hints about how i wanted him to propose.  When he did propose it was during a random vacation that I had planned. I was happy but I couldn't help feeling disappointed too. I had told him numerous times before that I wanted him to do it in front of my friends and family. I know it sounds dumb to be upset but I couldn't help how I was feeling. We are now married but the wedding and ring were also far from what I wanted and it wasn't due to lack of funds. I know this is all material and the marriage is the most important thing but I cant help but get jealous and envious every time I see someone get a proposal or wedding that I had wanted. I cant help my anger because I know we only get one proposal and one wedding. What I wanted will never happen. I have been working on my feelings for the past year and half to get over it. I try to focus on our marriage but every time I see someone have the best proposals and weddings I get upset. I know it is selfish and I know its petty but I just can't control it. It's ruining our relationship because I constantly think about it. Plus, I get mad at him for small things because I am trying to hide the fact that I am so disappointed.  Why can't I move on?", "output_text": "It's hard to let go of the dreams you had regarding your wedding and engagement. This was something that you and most women think about for years, so it's understandable to be disappointed. But please be aware that it is rare that any wedding is perfect. You may envy your friends' weddings but more than likely they had a few mishaps of their own and/or it wasn't as perfect as they had planned it either. However, like you know, the marriage is the most important thing. How many women are envious that you are in a happy, stable relationship? I assure you that there are plenty. Try to live in the present considering that dwelling on the past can still not change how you were proposed to or how your wedding day transpired. Focus on what you can control NOW. Perhaps, you can plan an extravagant renewal of your vows or change the look of your ring?I would also be upfront with your husband and explain why you've been short lately. But after that, close that chapter and move on. It sounds like you have a wonderful co"}
{"input_text": "I'm going through some things with my feelings and myself. I barely sleep and I do nothing but think about how I'm worthless and how I shouldn't be here.\n   I've never tried or contemplated suicide. I've always wanted to fix my issues, but I never get around to it.\n   How can I change my feeling of being worthless to everyone?", "output_text": "Hi there, I'm sorry you're feeling this way. Let me see if I can guide you in the right direction. Often when I talk to my clients about feelings of worthlessness we start with a little bit of self-exploration. We start with noticing. Start to notice when these feelings come up for you. Is there a particular time\nof day, a specific person who brings it out, a phrase you hear? Just\nstart to notice. Usually it's tied to something but it may take a while to figure out what that something/someone is. Try to be patient.Next we start to explore. When did these feelings start? Where do you think they come from? Is there something - a statement - perhaps that repeats in your head over and over again? If so, whose voice is it? These are difficult questions, and just a few of them, so take your time answering them. (We usually do it over a few sessions.) It might even be helpful to write them down somewhere. If you have a journal that would be a great place as research has shown that our brain works differently when we"}
{"input_text": "My grandma had a stroke and passed away recently. I lost my home and job. I'm looking but haven't found a job. I've been binge watching television and binge eating.", "output_text": "Hello!I write to respond to your recent inquiry for possible increase in self-esteem and positive behavioral change regarding motivation for a new job. First of all, please try to allow yourself some time for grief of the loss of your dear grandmother. It appears you were close to her in many ways and she had a great influence in your life. The grief process of anger, denial, despair and acceptance may be a part of what is keeping you feeling \"stuck\" in a cycle of not feeling motivated to find work at this time.  Perhaps your mind is constantly fighting this grief? Death can be a \"traumatic\" experience for some people and is considered a great loss, thus the grief process may continue to be a part of your world for a time but hopefully not keep you \"stuck\" on a long-term basis.  I would try to reach out to a counselor to discuss this grief process at a deeper level to discern whether her death is part of why you feel this way.  Grief and loss can also have an effect on your self-esteem.  Can you begin to see "}
{"input_text": "Is it normal for people to cry during therapy, or is it just me?", "output_text": "Yep. Counseling can be very emotional at times. I've recommended to clients, on occation, that they allow themselves the rest of the day off after doing trauma work."}
{"input_text": "Whenever I sing along with a song that I like (even if it's just for the beat and not the lyrics), my boyfriend assumes that the words of the song mean something negative about our realationship.    I don't why he gets so mad and assumes I mean something negative from every song. Now I can't enjoy and sing a song without him thinking I'm trying to give him a hint. He even accuses me of cheating and lying. It's driving me nuts. I love him and would never do such an awful thing ever. How can I get him to understand?", "output_text": "Well, have you told him similar descriptions of your feelings as you just wrote here?This will give him the same understanding you're allowing us to have here on this site.Keep in mind that the best, the amount and the number of times you tell your boyfriend some information about you, still means that whether or not he is willing to accept and rely on your information, is in his hands only.Try to feel satisfied with your own effort to explain yourself.   Another path to open is to ask your boyfriend his reason to feel insecure about your love for him.  This may open a wider discussion about what he feels he'd like from you so he feels good in the relationship."}
{"input_text": "What makes a healthy marriage last?", "output_text": "Thank you for your question.  A good Marriage is one that takes hard work and commitment.  Being in a good marriage does not always mean good times because let's face it; we are dealing with 2 unique individuals with differences.  A good spouse or partner knows to be patient and accepting.  Knowing each other's strengths and imperfections and working with them to lift each other is how you strengthen your love for one another.  A good spouse sacrifices their needs to see the other person happy.  Don't get me wrong, that also means that it is important to have alone time to re-charge and re-focus our purpose in the marriage.  In all, there is not a magic recipe for a successful marriage, but with time, work and purpose one can have a happy one."}
{"input_text": "Is it normal for people to cry during therapy, or is it just me?", "output_text": "It is absolutely normal to cry in therapy. Therapy is a place to be honest about and explore your feelings without feeling judged. Honesty is the only way you will benefit from therapy and that means being willing to look at your true emotions rather than avoiding them."}
{"input_text": "I am currently living in a hotel and I don’t have a family. I met a guy a month ago. He is a bisexual. He has a lot of gay friends on social networking sites. He would not help pay for the room. When I asked for the TV remote control, he threw it elsewhere and asked me to get it. I slapped him and asked him to leave my room. We recently just got back together. One time I was sick. He came to visit and feed me but left no money. Then he texts me and brags about his house and car knowing that I have struggles living at a hotel. He says that he has a whole house where he can put me in and orders me to text him whenever I need someone to have sex with. He left his bath soap so he could come and get it. I think that he is trying to find a way to come back. Please help me. What’s going on? I am a good, loyal woman. Why is he treating me like this?", "output_text": "I am less concerned about this man as bisexual and having gay friends, than about how you feel is treating you.  You are in a vulnerable position because of social isolation.  If you have friends to talk to, please reach out.  While this man has money, it is not his job to take care of you financially unless the two of you have decided that together.  It sounds like he sometimes cares for you and other times you feel disrespected.  I would suggest you look for a man that is consistent in his love and care.  This is not your fault.  But you are in control of removing him from you life or choosing not to because he meets some of your needs.  Take care."}
{"input_text": "They don't go away, and I feel like I'm going crazy. Does that ever stop? Can it be a symptom of medication?", "output_text": "This can certainly be a side effect of some medications. If the voices are so powerful that you can not sleep or they are constantly present, you shouldn't wait any time, but go and see your doctor straight away."}
{"input_text": "My daughter is in later elementary school. She can't color in the lines. Her words jumble together when she writes unless there are big spaces or she skips lines.", "output_text": "At times when a child is not displaying milestone behavior at the same rate that is average for their peers, this should raise concern, so you are correct in reaching out for advice. Speaking with your child's pediatrician, as well as school staff may be the first places to start. You can request that she receive an assessment and evaluation, with a subsequent treatment plan to meet any needs she may have."}
{"input_text": "Is it normal for people to cry during therapy, or is it just me?", "output_text": "It's absolutely normal.  Therapy provides a space where you can be free to express yourself and experience all of your emotions fully.  Crying is a form of release, and many people feel like they do not have any other space where they can let out their emotions.  Crying can be a healthy way to be present with your emotions.  While not everyone will cry during a therapy session, you're not the first, and definitely not the last."}
{"input_text": "How do you know you have the right therapist for you?\n How would I know how to \"train\" my therapist to be able to give me what I need from treatment?", "output_text": "Hello and thanks for your question! It's important to have the right therapist. I encourage you to start by checking out the website of the therapist. Their blog articles will reflect the kind of work they do and the approach they may take while working with you. If there's an email listed, go ahead and reach out. Ask the particular questions that are on your mind. Share a little of what you are looking for in a therapist. Are you a goal-direct, solution-focused individual who is looking for someone to listen and ask questions? Are you less self-directive and desire a therapist who can give you the consistent push to move forward? Are you interested in intertwining certain theory approaches? Maybe a cognitive-base or experiential? Art therapy or engaging in exercise while talking? Your therapist is out there. It's OK to try out a therapist for a session or two. Interview them as they interview you. It's also OK to change therapists; ask your present therapist for a referral. He or she should be willing to pro"}
{"input_text": "My boyfriend won't touch me intimately, he won't kiss me while we are having sex and he won't have oral sex with me. I know he has done this things with other women in the past. I don't know why he won't do them with me. What should I do?", "output_text": "First off, don't blame yourself or be too quick to jump to any scary conclusions.  Human sexuality can be incredibly complex at times (e.g., what turns us on at one time may not be what turns us on the next time). There could actually be a number of things going on including him having performance anxiety...maybe he had a bad experience with a previous partner that's left him scared to try again (we call this operant conditioning).  It could also be that he puts you in a different category than previous lovers.  Sometimes I refer to this as the \"hooker-housewife mentality\" where a partner somehow gets the idea that when we truly fall in love, we treat that one differently; almost up on a pedestal.  Drives many partners crazy until they're aware that this is going on and give their boyfriend/ girlfriend permission to enjoy both the naughty and the nice with them. It could also be that he's not even aware that he's not doing these things. If you haven't asked him yet, you might try gently approaching the subjec"}
{"input_text": "I just don't know what I want in life anymore. I'm can't figure out what it is that is keeping me distracted and unfocused. I can't put things into perspective at all. I'm just stuck, and I'm disappointed with my lack of accomplishments.", "output_text": "Check this blog out:  Four-ways-add-self-esteem-friends-listHope you find a few nuggets of helpfulness in this."}
{"input_text": "I have so many issues to address. I have a history of sexual abuse, I’m a breast cancer survivor and I am a lifetime insomniac.    I have a long history of depression and I’m beginning to have anxiety. I have low self esteem but I’ve been happily married for almost 35 years.\n   I’ve never had counseling about any of this. Do I have too many issues to address in counseling?", "output_text": "It sounds like you are feeling pretty overwhelmed. But you are also a survivor and have the benefit of a long, stable marriage. You do not have too many issues to address in counseling. A good therapist will help you to partialize your goals into smaller objectives and focus in on what's most pressing for you to address first in treatment."}
{"input_text": "I need to get on base to see my doctor. My ID card was in my wallet which was stolen. I’m unable to reach my husband at this time. He is only one who can take me on base in order to get a new ID so I can continue to see doctor. Is there anything I can do?", "output_text": "You should be able to get a replacement ID card either from the Personnel Office on your local base (the actual name of this office will vary depending on which branch of the military it is). You may also be required to go to the Military Police or Security office on base to report the loss of your old ID card."}
{"input_text": "I've never been able to talk with my parents. My parents are in their sixties while I am a teenager. I love both of them but not their personalities. I feel that they do not take me seriously whenever I talk about a serious event in my life. If my dad doesn’t believe me, then my mom goes along with my dad and acts like she doesn’t believe me either. I’m a pansexual, but I can’t trust my own parents.\n I've fought depression and won; however, stress and anxiety are killing me. I feel that my friends don't listen to me. I know they have their own problems, which I do my best to help with. But they don't always try to help me with mine, when I really need them. I feel as if my childhood has been taken from me. I feel as if I have no one whom I can trust.", "output_text": "I'm sorry you feel so alone and isolated, those feelings in and of themselves can lead to depression, stress and anxiety.  So job one is finding someone you can talk to.  A good friend or an open parent can be as helpful as a professional counselor, but if you don't have those, then by all means call your local Mental Health Association, suicide prevention, or go see your school counseling department. There are many of us now who do on-line, FaceTime, phone counseling so that is an option to consider in your situation.  On the other hand,  If you want to script a conversation with your parents (I'm a great believer in scripting) not that you're going to read it to them, but if you write down exactly what you want to say, read it over a few times before you're ready to have the conversation.  Why?  You'll be much more likely to do it if you're prepared, and you'll  have a better chance of saying everything you want to say in a calm but forceful way.  The same with your friends--you are probably a great listene"}
{"input_text": "I don't know how else to explain it. All I can say is that I feel empty, I feel nothing. How do I stop feeling this way?", "output_text": "A feeling of emptiness can be from a lack of awareness and acknowledgment for the things, the people, the places that you have in your life. The use of affirmation and gratitudes helps to remind ourselves of all of the aspects of our lives."}
{"input_text": "We had our first kid 15 years ago, and sex has been nonexistent ever since. It only happens every three or four months. We have been to counseling, and I have been told over and over again she will come around. She hasn't, and I'm intimately lonely! I think it's time to move on, but how do I do that without hurting my kids?", "output_text": "Hi Pocahontas, This is a painful situation. When you're in a relationship, you assume that you will continue to receive warmth and affection. When it dries up, it's a very lonely place. It's possible that there is an unaddressed issue in the relationship. It's also possible that your partner has hormonal issues, pain issues,  sexual dysfunction or is asexual. There is no one answer here. Only you can decide what is right for you. But let me ask some questions to help you explore next steps:Aside from the sex, is your wife loving and supportive? What are the other ways in which you feel loved? Does your wife talk to you? Does she communicate her needs and desires? Does she articulate what gets in the way of having sex? If your wife is generally a loving, open partner, you use this to see that her behaviours aren't personal. Whether she resolves this or not, it can help you to cope with the rejection. This is your wife's issue, and the \"ball\" is in her court.In my opinion, if couple's therapy hasn't helped, it'"}
{"input_text": "I don't know how to tell someone how I feel about them. How can I get better at expressing how I feel?", "output_text": "\"Practice makes perfect\"!Simply by expressing yourself and listening to if others listen and understand you, then modifying your next try with whatever improvements you think of based on the impressions you feel others have of you, will progress your self-expression.Also, one way to lessen the tension before speaking to someone is to tell them you feel unsure on how best to express yourself.  This way you've prepared them to be patient with whatever words you do state."}
{"input_text": "Does counseling really do anything that can help people?", "output_text": "You are asking a room full of counselors, and so I am going to guess that we may be a bit biased :). My answer is this: sometimes. Many people benefit from counseling and when counseling works those benefits can show up through positive improvements in your moods, making more choices that align with your values, working through stuff, and a general improved sense of self. Sometimes, for a variety of reasons, a counselor, the approach they are using and the person do not match up and when that happens sometimes counseling does not help. It is very important to find the right counselor for you. Ideally this should be someone you feel a level of trust and connection with who is also using a style that you feel confident in. Research has shown that these aspects (what is called the 'therapeutic alliance') along with shared goals between the client and counselor give counseling the best chance at being effective"}
{"input_text": "My mother and I have an okay relationship. I know she loves me unconditionally, and I love her the same. However, more times than not, I'm afraid to tell her anything personal because she either doesn't listen, she turns it around and makes everything about her, or she ignores things - even when they are about my mental health.", "output_text": "Could you tell her ?  What would happen if you said \"Mom, I love you and I really want to share myself with you, but often I you get upset and I don't want that to happen. I really want to be able to talk to you.\""}
{"input_text": "I'm obsessing about a terrible breakup. Everything is a constant reminder. How do I move on?", "output_text": "Dealing with a breakup is difficult. We have high hopes and then those hopes and dreams are dashed and we feel at a loss for how to deal with this sudden change in our lives. First, it is important to acknowledge that losing a relationship is a loss and we need to grieve that loss. If we don't allow ourselves time to process and move through the grieving process, we may remain stuck and it may make it hard to move on. So in some ways, you don't want to move on too soon by just trying to ignore your feelings. Instead, take good care of yourself, talk to friends and give your self time to heal. The second most important thing is to forgive yourself; this is also an important part of taking care of yourself. You might be blaming yourself and re-living moments when you wish you would have done things differently. By replaying those thoughts you remain stuck. When we begin to forgive ourselves, we truly begin to heal. Lastly, in my experience the people who have the most difficulty moving on have not really severe"}
{"input_text": "My dad is doing some really bad drugs, and I'm not allowed to see him anymore because of what he can do to me or my siblings on this drug. It has affected me tremendously in my life. It’s even caused me anger and stress.", "output_text": "It seems like you are going trough stages of grief, since the inability to see your father causes you similar feelings as if you had lost him.  Perhaps you could send him letters expressing your feelings and hopes.  But do understand that if he is under the influence of drugs he might not be able to empathize with your feelings or react in the way that he would have done so in the past.  As the issue evolves find a therapist or counselor to help you work on letting go of that anger and stress, which may affect you negatively.  Find forgiveness so you can have a relationship with him in the future.  ¿Qué puedo hacer con mi padre usuario de drogas?Mi papa está usando drogas muy malas, y no estoy autorizada a verlo por lo que me puede hacer a mí y a mis hermanos.  Esto afecta mi vida tremendamente.  Me causa coraje  estrés.Parece que estas pasando por estados de luto, ya que el no poder ver a tu padre causa sentimientos similares a cuando hay una perdida.  Tal vez puedes escribirle cartas expresando tus sentimie"}
{"input_text": "How does a counselor decide when to end counseling sessions or to terminate working with a client?", "output_text": "Counseling ends when the client has received the maximum benefit from the therapist. Even if the therapist believes the client is not making progress, the client may feel they are improving and receiving a benefit. And the therapist may see a benefit and the client does not. It is best to have ongoing dialogue with the client to determine when termination is appropriate."}
{"input_text": "I had to go to the emergency room today to get an X-ray of my spine. My boyfriend didn't want to sit there and wait with me. Instead, he wanted to go do things for his friends while I waited. When I was done, he was twenty minutes late in picking me up. He doesn't understand why I'm mad, and we keep bickering at each other over the smallest things. He thinks I don't have a reason to be mad, but I believe that I do.", "output_text": "Hi Moore, Underneath all your anger is a lot of hurt. The hurt is there because you are being disrespected. Your boyfriend (unless you've only told me a small, disproportionate part of the bigger picture) doesn't tend to treat you like you're important and he dismisses your emotions. This is happening because this is the level of ability (disability?) he has right now in a relationship. You can expect more of this behaviour (because that's who he is; it has nothing to do with you), and I hope you think carefully about whether it's working for you to be in this. You could try telling him that you are hurt, because people tend to listen more to hurt than to anger, but my guess is with him it might not make a difference. I hope you talk to someone who knows and supports you about how you're feeling in this relationship."}
{"input_text": "I have anxieties about everyday stressors, i.e. finances, work, relationships, kids, and maintaining a household.", "output_text": "Since it is clear that people react differently to the same stressors, we know that the stressors are not causing the anxiety, our thoughts about the stressors are. Often, cognitive distortions are the problem. Some common cognitive distortions include catastrophizing (predicting the worst), future telling, black and white thinking (if it's not perfect, it's terrible), mind-reading (I just know he is angry at me) and can't-standitis (I can't stand this situation). There are more, but the list is long, and if some of these are resonating with you, I would advise looking up CBT (cognitive behavioral therapy) tips, worksheets, booklets etc. on line, or contact a local CBT therapist. Another helpful piece of info on anxiety, is that it is prone to something called \"symptom stress\" - being anxious about anxiety. If we could hear this symptom stress it might sound like, \"Oh no I'm getting nervous about this, I'm getting uptight, I look nervous, what if I have a panic attack!\" followed by  more cognitive distortions"}
{"input_text": "My mom made a lot of mistakes a couple years back, and I can't seem to forgive her. I want to say that it's okay, but I can't. I feel like even if I did forgive her, I wouldn't be able to say it to her face.", "output_text": "How someone feels when they forgive another, is at peace with themselves and their understanding of what went wrong, who was responsible for what in the situation, and clarity on their own motivation, actions, emotions including pain, regret, resentment, sadness.These steps ideally allow a new door to open in order to develop new paths in the existing relationship or accept that this will not be possible due to either person's way of handling themselves.The long answer would be that you're not yet through with this process.I commend you on being truthful with yourself about yourself.You're on the right track by expecting to feel resolved when you've reached resolution, and not before.Finding patience with the unpredictable amount of time needed to thoroughly examine all the details of the incidents you mention, sometimes is a frustration of its own.Keep up your good work of knowing your own life.It is a worthwhile endeavor!"}
{"input_text": "I feel like I am not at a good state of mind. I'm very unsettled in my soul. I'm not happy with myself or the decisions I make, which makes me not happy with anyone else. I feel like a failure most of my days. I don't feel like I'm good at anything anymore. I feel like less of a person.", "output_text": "It seems like you may be experiencing depression symptoms, they could be the triggered by unexpected life changes, or building up throughout time.The important part is that you have identified them and wanting to change them.  The first step is to establish a self-care routine that will help you to feel centered and motivated: go for walks, or make any physical activity that you enjoy ( be kind to yourself, anything helps at this point), eat balanced, add whole grains and fibers to your diet, make a point to rest at night and avoid naps, practice a hobby that you love, or look for a new one that you are curious about. You mentioned that you feel unsettled in your soul: explore your spirituality, meditate about what makes your soul at peace, and find ways to practice that or surround yourself by those activities.If you find it difficult to begin, talk to your therapist to identify roadblocks and ways to find motivation. Suicidal and homicidal thoughts are common but serious depression symptoms, discuss them wi"}
{"input_text": "I need help knowing how to deal with stress. What can I do?", "output_text": "Something different works for each of us.There are the outward answers of self-pampering and making your home and work environment as pleasant as possible.A deeper level way to decrease stress is through exercise or alternative practices like yoga or tai chi.If the stress is more deeply rooted than temporarily feeling irritated for a few days, then give yourself some time to reflect and clarify what the meaning of the stress is to you.Self-understanding and appreciating your efforts to know yourself may decrease stress because you'll be more focused and attentive to who you are.  This will influence you overall to make good decisions for yourself and these will naturally be ones which decrease stress as much as possible."}
{"input_text": "I have PTSD. The side effects are really bad and have impacts on sex, anger and my relationships. I even lost my job month ago.    How can I get my life back?", "output_text": "It is brave of you to speak out, PTSD is not a joke and it can quickly take a toll on all aspect of life. Please, know that you are not alone and with the right help you can overcome these challenges. Living with PTSD can be very emotionally exhausting, but you can learn ways to cope with its challenges and find fulfillment in your life again. This means being proactively involved with the process, learning about the problem and positive ways to manage it can be a good start. This can also mean seeking professional help. It is important to address the problem both at the physiological and psychological level, this can mean using medication that is prescribed by a MD to reduce the intensity symptoms and also working with an experienced licensed professional. Having healthy life habits such as good sleep hygiene, healthy diet, staying away from self-medicating with drugs and alcohol, and exercising can help reduce the intensity of the symptoms as well. Please, consult with a licensed professional close to you t"}
{"input_text": "My mother has Alzheimer's and she has become so nasty and mean to everyone and she always asks for unrealistic, silly or meaningless items. I get so frustrated and angry, but then I feel guilty because I know it probably isn’t her fault. How can I cope with feeling like this?", "output_text": "There is some great advice here that can really help, but you need some direct support.  Please find a caregiver support organization, a grief group and an individual therapist to help you during this trying time.  Your mom may not know what she is saying, or mean the awful things she says, but that doesn't make it hurt less.  Please take care of yourself and gt some help!"}
{"input_text": "I've been going through a rough time lately. I been into nothing but women. I’ve never thought about men until a week ago. I’m very upset and depressed about this. It's not normal to me. I looked at gay porn more than once to prove that I’m not gay. I get the same results each time, and I feel disgust. This is tough on me. I'm scared that I looked too many times. I keep thinking about it and shake all the time.", "output_text": "Hi Brookfield, It can be unsettling when we feel something as fundamental as our sexual orientation shifting. I like that you're honest enough with yourself to say \"I'm struggling with this\". To accept that there is a question is a brave place to be. And...it doesn't necessarily mean you're gay.Unfortunately, we live in a culture that wants to put people in slots...male or female, straight or gay...we tend to not like those grey areas so much as a culture. The truth is that, if we grew up in a society where there wasn't this categorization...if we felt free to explore and grow sexually, we might be surprised at who we are attracted to. You don't have to put yourself in a slot. Our sexual preferences are more fluid than we think, and it can change over time.We also live in a culture where there is prejudice against homosexuality or \"differentness\" in general. The wish to not be gay can be powerful. Many people who are gay spend years believing they were heteroxual...fighting against, repressing  or ignoring th"}
{"input_text": "My mother takes care of niece whom my sister abandoned. She calls me every day complaining, but I don't want to hear it anymore.", "output_text": "This sounds very stressful.  Setting boundaries is important to maintaining a peace of mind.  If you have not communicated your feelings to your family member, that would be a good first step.  Communicate with the intent of simply expressing your feelings and your expectations going forward.  Do not blame or shame because that will blur your intent.  Going forward, consistently stick to your new boundaries.  That may mean not picking up your phone for each call.  Soon enough the message will be clear.  Good luck."}
{"input_text": "How do you know you have the right therapist for you?\n How would I know how to \"train\" my therapist to be able to give me what I need from treatment?", "output_text": "You know have the right therapist if:Your counselor specializes in what you are seeking help for or they have experience with treating people with similar issues.They are ethical and are able to understand your culture or religious norms.They are licensed in your state.They are able to provide you treatment that is tailored to your needs so that you can meet your goals for therapy.They are non-judgmental and can show empathy to you.They can meet you were you are in your journey of healing and understand you.The location of the office or use of technology to hold sessions is something that you are comfortable with.Recognize that a relationship with a counselor is like a relationship with any other person, sometimes you mesh well and sometimes you do not mesh well. A counselor should never take any offense if you do not feel like a good fit with the counselor, just be honest with your counselor about how you are feeling about the relationship. If you feel the need to change counselors, feel the freedom to chang"}
{"input_text": "My husband and I have been married for seven years, and in that time, we have only had sex four or five times. Others have told me that most men would have left me by now. Honestly, I think I have a low sex drive or neither one of us actually knows what we are doing. I want to be better connected with my husband.", "output_text": "I work with many couples that experience a wide range of sexual and relationship challenges. The one aspect I tell many folks that I work with, is this: Every person and relationship is different. There really isn't a \"normal\" amount of sex a person should have or want to have. If having sex 4 to 5 times in the course of your relationship is satisfying to you and your husband, there is nothing wrong with it. If you or your husband would like to have sex more often, I suggest talking with a counselor about this to find ways to engage in a sexual life in which you are both satisfied. The aspect of connectedness is an important one. While sex can be very connecting for many couples, it isn't the only way to connect. I find that communication about the matter of frequency of sex, checking in to see how you and your husband feel, as well as communicant about your needs for connection are an important start to fulfilling this need."}
{"input_text": "There are issues from my past that have me very heavily burdened in my heart. I've been torn for so many years and I need help so I can move on with my life.\n   I experienced trauma when I was 8 years old and I did come out about it until I was 40.\n   Now I know this is what's holding me back on my happiness. I've met a very loving and caring man but because I'm holding on to these things from my past I’m pushing him away.\n   How can I get my life back?", "output_text": "I'm so sorry you had that horrible experience! It's common for those who've experienced childhood trauma(s) to not disclose the events until later in life. Sometimes it doesn't feel safe enough to share the information until the person who hurt them is far away, or even dead.  Trusting and vulnerability are difficult, especially when we've been hurt. So, it's not uncommon for clients to share that their desire to be close to their loved one (emotionally, physically and/or sexually) doesn't match the reality of what they are able to actually experience.But, there is hope!You have met a loving and caring man, and you have a self-awareness that you did not experience before. I am confident that the help of a licensed professional counselor (preferably trained in trauma recovery) can help you navigate this healing journey and help you gain the tools needed for the life you want."}
{"input_text": "I'm dealing with imposter syndrome in graduate school. I know that by all accounts I am a phenomenal graduate student, and that I am well-published. I am well liked by students and faculty alike. And yet I cannot shake the feeling that I'm going to be found out as a fraud.    How can I get over this feeling?", "output_text": "I'm sorry you're feeling this way. You've probably read articles already about impostor syndrome, but still didn't get the answers you were looking for; you probably know that lots of people feel this way, that it happens to lots of successful people in professional settings. Not helping, right?Think about people who succeed at big tasks: an Olympic athlete has a defined goal that they need to meet: cross the finish line, say, faster than anyone else. That success is remarked upon, and - until someone does the event better than they did - they are 'the best.' Grad school, however, is not so great at discrete goals and celebrations of success. You got a good grade on an assignment, but what about the next one? You and 6 other people in your class probably got the same grade, so does that make you a success or average? It falls to you, then, to identify ways you are sure you've succeeded. If your grades and peer admiration aren't hallmarks of success enough, perhaps pull your measuring tool inward: measure your"}
{"input_text": "I have been falling into a deep depression where I can no function during the day and night. The only time I am at peace is when I’m asleep. If I am with friends, family, at work, and mainly alone, I cannot think straight. I no longer feel like myself.", "output_text": "I don't know how long ago your breakup was, but I would suggest that you reach out to friends or family that you trust and perhaps a local mental health clinician.I'm not sure what you mean when you say that you are not able to function during the day and night. If you are having trouble sleeping for more than a few nights, consider talking with your primary care physician. Not sleeping can really make changes in your emotions seem much larger.Can you find anything in your life that is the same as it was before the breakup? This may be a starting point for you. I wonder if you could think of and moment or two each day when you feel emotionally at peace while you are awake. Also consider looking at things that you can control, such as when you choose to wear, eat, and who you talk to about your deepest feelings.You mentioned that you have friends and family. I wonder if any of them are supportive to you.Please reach out and talk to someone about the details. I get the sense that you feel that you are alone in "}
{"input_text": "I am a heterosexual male in my late 20s. I find myself wearing pantyhose, heels, skirts and other women's clothing in private. I am torn on how to feel about it. I enjoy it very much. I have had a pantyhose/stocking fascination and other kinky fetish interests since I was young. I have no history of sexual abuse growing up. I am currently single.", "output_text": "Let yourself enjoy crossdressing!What sounds in your way are whatever beliefs you gre up hearing, see and absorb currently.Concentrate on your own satisfaction and that you are doing this in a non-harming way.Maybe if you branch out your interest by finding other people who enjoy crossdressing as much as you do.With any interest or activity, social interaction supports it."}
{"input_text": "I have so many issues to address. I have a history of sexual abuse, I’m a breast cancer survivor and I am a lifetime insomniac.    I have a long history of depression and I’m beginning to have anxiety. I have low self esteem but I’ve been happily married for almost 35 years.\n   I’ve never had counseling about any of this. Do I have too many issues to address in counseling?", "output_text": "You do not have too many issues to address in counseling.  And your perseverance will serve you well if you choose to engage in therapy.  The trauma and medical event you experienced topped off with chronic sleepless nights would lead to feelings of depression for many.  The emotional reaction you've had to these experiences sounds normal albeit troublesome and I would imagine intensely painful at times as well.  Therapy can help prioritize what is the most impactful issue you are grappling with.  I find in therapy that when the central issue is revealed, understood, processed, and understood again in its current context, many other areas of the person's internal experience improve.  It sounds as though something has prevented you from seeking help from a counselor in the past, and it sounds as though you are more seriously considering it now.  Therapy helps and it can help you when you're ready."}
{"input_text": "My wife and I got separated because I asked about her contact with a male friend of hers. The next day, she kicked me out. She let me move back two days later. Yesterday, she said she wanted a divorce then quickly changed her mind. I asked if the other guy was a factor, but she says it's not my business.", "output_text": "When \"threats\" of leaving, such as what you described in your question (\"kicking you out, wanting divorce\") are continuous in your marriage, it can start to erode at the foundation of your relationship, impacting both partners. And, if you're concerned about the influence of another male in the relationship, and are unable to express your concerns or fears to your wife, it's extremely difficult to build a secure functioning relationship. From the information provided in your question, it seems as if there is some avoidance evident in your relationship. Avoidance of being able to express yourself and have honest communication about your relationship. If your wife is willing, I would recommend seeing a marriage counselor to help you both during this time. Or, for you to talk with an individual therapist, if marriage counseling isn't an option."}
{"input_text": "The father of my kids and I have been broken up for about three years now. We always found our way back to each other. He had a baby with someone else he's with but still shows the same love he showed when we was together when he's around. He even gets jealous, but he ignores my calls.", "output_text": "Your story sounds like it gives you a great deal of tension and disappointment.You know you are not getting the amount of love and kind of relationship you'd like.It is almost as though you feel that \"something is better than nothing\".Reflect within yourself whether the balance of what you receive in this relationship is worth the sacrifice of not getting as much love as you wish.Depending on your decision you will know whether to drop this relationship or continue the same as its been."}
{"input_text": "I start counseling/therapy in a few days (I'm freaking out) but my main fear is that I'll cry and embarrass myself, is it something to worry about?", "output_text": "People do cry in therapy sometimes, but it's not at all necessary to cry in order for most kinds of therapy to be helpful. When you start counseling you don't yet know your counselor very well, so it's normal to keep your feelings in check until you feel comfortable and a bit more relaxed with your counselor and with the situation. Sometimes, though, there are emotions that have been waiting and waiting to finally find someone who will listen with a kind ear. If you feel safe right away in the situation with your counselor, you might just cry in spite of your fears about it. Your therapist is used to people expressing how they feel and will keep strict confidentiality, so even though it's embarrassing, finally experiencing someone truly listening with empathy and kindness may just be worth it. It's okay too to let your counselor know right at the beginning that you're kind of freaked out about getting too emotional in front of another person."}
{"input_text": "I have PTSD. The side effects are really bad and have impacts on sex, anger and my relationships. I even lost my job month ago.    How can I get my life back?", "output_text": "This is a great question. PTSD can be very complex and debilitating. It must be very difficult for you at this time.When we feel complex emotions such as anger, frustration, and possibly low-self worth, the tendency is to try to avoid or suppress these emotions. The more you avoid them, the more these emotions will express themselves, and at the worst times. This may be why your PTSD symptoms are harming your relationships and your job status.To help you get your life back, it is important to process your emotions with a counselor that has specific training in trauma-informed interventions. To process emotions, you start by inviting them in, observe them with compassion and without judgment. When we observe our emotions, it starts the healing process because we separate ourselves from them. Remember, thoughts and emotions are constructed. You are not your thoughts, nor your emotions. They are messengers telling you to pay attention to them. The more we avoid the messengers, the louder they get, to the point t"}
{"input_text": "I was born a girl, but I want to be a boy. Because of my religion I can't tell my family. I know they won't accept me. What do I do?", "output_text": "Ultimately, to suppress your natural identity will work against you.However difficult, painful, frightening, it is to tell your family about your discovery about who you are, trying to avoid your own truth will do you harm eventually.One way to make this conversation easier for yourself is to prepare yourself for the outcomes you expect and know will be difficult.Take as much time as you need to accept the potential rejection because this way iff and when it comes you will be better able to handle it."}
{"input_text": "I haven't been feeling like myself lately. I've been upset for no reason and feeling anxious. I'm feeling burnt out. What can help me feel better?", "output_text": "There's no such possibility that you're upset for \"no reason\"!The reason is not obvious, not that you are feeling upset in response to nothing at all.What can help you feel better is to be kind and gentle with yourself because this sort of approach will more likely relax your mood and mindset enough for the tension and anxiety you feel, to dissipate somewhat.Try to understand whether certain situations or interactions remind you or feel similar to ones which distressed you before.This may be the reason for your anxiety.It is good news that you know the difference between your usual sense of yourself and that you've been away from this feeling.Give yourself a little credit for understanding yourself.   Giving credit adds confidence and confidence will help you find the reasons and new ways to handle your anxiety."}
{"input_text": "I'm 17 and I'm sick and tired of going back and forth. I'd like to stay at my mother's house. This problem has really affected me. I've had anxiety attacks and suicidal thoughts and self-harm in the past.    Currently I'm going through anxiety and my thearapist is not available. How do I handle this?", "output_text": "At age 17, I think you are old enough to decide which parent you want to stay with full-time. I would gently and lovingly tell your father that you've decided to stay with your mother. You can offer to visit him regularly, if you'd like. Parents often have a hard time letting go and, especially in divorce situations, your dad might feel as though he's \"lost the battle\" if you go live with your mom. He might also feel he's lost you. If your dad is unrelenting and the situation unbearable, you can ask a judge to modify the custody agreement."}
{"input_text": "My toddler defies everything I say and doesn’t see me as authoritative, so she says no about everything. I'd like to hear some ways I can work on not needing to feel so much in control all the time.", "output_text": "Hi Biddeford,This is a super goal. Feeling powerless is something parents are wise to get used to; there's a creature in the home whose job it is to find and use their power in the family and in the world. Of course your toddler defies you, and that's healthy. I worry more about the overly compliant ones. She is wanting to know what the rules are, and all you have to do is show her clearly where the lines are. I'll give you some tips.First, remind yourself that it's her job to learn what the rules are, and where her power is. Don't be so surprised when she wants it her way. If we go through our days being ready and prepared for these beautiful creatures to have minds of their own, we're less caught off guard when it happens. Avoid situations that invite power struggles. Any time you tell your daughter \"do this now\", you set up a power struggle. The good thing is that she's young enough you can pick her up; now is the time to teach her that mom's (or dad's) word means something. So, if you say \"let's get you d"}
{"input_text": "I been having anger problems a lot lately. It only takes one word wrongly said to set me off. I use to not be like this until I got with my soon-to-be husband. I think his mood and rage/anger problems have rubbed off on me a lot. I don't get nearly as bad as he does, but I yell almost constantly and I can't seem to just stop. I have two young babies that have to hear this, and I don't want my girls growing up with a mommy like I have been lately. I just don't know how to get back to my old self.", "output_text": "With me knowing that a healthy relationship usually includes respect, trust, appreciation, companionship, spiritual solidarity, domestic support, feeling of being cherished, and  sensuous affection, I am wondering if you are lacking in several if not all of these needs in your present relationship.  Before he becomes your husband, you should examine these areas and see if they are high in rating.  Otherwise, yes this relationship will affect your girls and you negatively.  I would suggest relationship counseling, specifically pre-marital.  Not be surprised if through the process you realize that this relationship is not the best choice for you and your children."}
{"input_text": "I have so many issues to address. I have a history of sexual abuse, I’m a breast cancer survivor and I am a lifetime insomniac.    I have a long history of depression and I’m beginning to have anxiety. I have low self esteem but I’ve been happily married for almost 35 years.\n   I’ve never had counseling about any of this. Do I have too many issues to address in counseling?", "output_text": "The most direct answer is no. I would venture to guess that several of the things you are feeling (symptoms) are connected. I would recommend a trauma counselor. You have several strengths (resources) that you are able to pull from and I would encourage you to focus on them as you deal with the issues you have placed on the back burner for so long. Sometimes people are afraid to address things because they feel or believe that they won’t be able to handle it. Compare it to a tornado. The storm has passed, but you are still in hiding for fear of the aftermath (the mess left behind). A good therapist is like a personal organizer to help you."}
{"input_text": "I feel too scared to meet people I don't know - even relatives. I don't ever raise my hand or talk in school. I feel like no one understands. How can I handle this?", "output_text": "It certainly sounds like you have some anxiety. Before deciding whether it was social anxiety or a more general type of anxiety, I would wonder what it is that you think will result from you raising your hand or talking to someone you don't know. Here is some information on social anxiety: https://socialanxietyinstitute.org/what-is-social-anxietyI would recommend talking to a local mental health professional. It sounds like your anxiety is affecting your daily life and there are lots of strategies that may help to lessen that.Thanks for being brave to post here."}
{"input_text": "I have been married for 11 years. Within the past 2 years we have drifted far apart. We coexist together but there is very little personal interest in each other. I often feel that my husband has \"friends\" at work that he is more emotional invested in than me. I feel very alone and just uncared for. Is there anything I can do to feel reconnected?", "output_text": "I'm sure you've tried to talk to your husband, but if not, could you? Have a conversation with him about him and his life, his work, etc. See if he relaxes and opens up to you, even a little bit. Don't try to have a heavy conversation or even unburden yourself to him during this first conversation - just try to be light-hearted and focus on hearing him. It's the first step towards getting your needs met too, and ending any emotional standoff that might have come about between you."}
{"input_text": "I have so many issues to address. I have a history of sexual abuse, I’m a breast cancer survivor and I am a lifetime insomniac.    I have a long history of depression and I’m beginning to have anxiety. I have low self esteem but I’ve been happily married for almost 35 years.\n   I’ve never had counseling about any of this. Do I have too many issues to address in counseling?", "output_text": "Usually people who struggle with depression also have symptoms of anxiety. These symptoms come about as a result of underlying causes. The obstacles you have been overcoming such as abuse, cancer and insomnia likely bring about similar feelings and emotions in you which affect your self-esteem. Counseling is meant to support people who have layers of difficulties. We see the difficulties as layers to an onion, peeling away the many layers."}
{"input_text": "When my daughter is stressed about a silly thing from school, she starts crying and freaking out. She is a bright student, always has a 4.0, but I am afraid she is stressing too much. I’m afraid it’s going to break her. I don't know if I should get her to a doctor or someone because this is not normal.", "output_text": "Oh dear - this is becoming all too common.  I suggest you have some conversations with your girl to figure out where she is getting the \"information\" that she builds anxiety around.  I see teens  who have heard teachers, parents, coaches, etc push the \"highly selective colleges\" idea on kids way too much.  Teens in particular are prone to black and white thinking, leading them to see one poor test performance, one off day, one not-great assignment as the make-or-break task on the path to successful adulthood.  If that's the case with your daughter, she needs you to help modulate both the incoming information (there are nearly 5000 colleges in the US - she will get into one of them!) as well as her reaction to that information.As well, you and any other adults that are involved in parenting her need to discern fact from fiction.  The recent scandal around celebrities \"buying\" their kids into college is an indicator of how far off track we, as a culture, have gotten in terms of education.  A college education i"}
{"input_text": "After 40 years of being straight, how could I now find myself interested in people of the same sex? I have had a few same sex encounters of my own doing.", "output_text": "Sexuality is fluid. It is possible to find yourself attracted sexually or affectionally to different types of people at different times in your life."}
{"input_text": "I get so much anxiety, and I don’t know why. I feel like I can’t do anything by myself because I’m scared of the outcomes.", "output_text": "The are two ways that such anxiety can be dealt with. One is an attempt to replace maladaptive thinking by examining the distorted thinking and resetting the fight-or-flight response with more reasonable, accurate ones. As an example \"I'm scared of spiders.\" But if you change the thinking from being scared to \"I'm bigger than the spider,\" it allows the mind to reach a calmer state of mind. Mindfulness-based therapy can also help  focus on the bodily sensations that arise when you feel anxious. Instead of avoiding or withdrawing from these feelings, remain present and fully experience the symptoms of anxiety. Instead of avoiding distressing thoughts, open up to them in an effort to realize and acknowledge that they are not literally true.Although it may seem counter-intuitive, fully realizing the experience of anxiety enables the release of over identification with negative thoughts. You can practice responding to disruptive thoughts, and letting these thoughts go.By remaining present in the body, you'll learn"}
{"input_text": "I'm having a quinceañera, and the girls don't like their dresses. They never told me, and now it's a week away. I don't know what to do.", "output_text": "How did you find out that the girls aren't happy with their dresses?Did you hear this directly from one of them or is this third hand information that someone else told you about one of the girls in your party?The answer matters because gossiping instead of directly telling you about a problem, is a problem in itself.I suggest a conversation with the entire group of girls in which you tell them how you actually are feeling about their opinions about the dresses.One topic you may consider bringing up is what everyone expects to get out of the party.  Are they coming because they like one another and wearing a dress in which the girl is happy, is only one way of having fun together?You may learn a great deal as to the difference in values about a quinceaña among you and your friends.I hope you'll have a fun party!"}
{"input_text": "I've only been married three months. Every week, we argue about something, and it seems to be getting worse.", "output_text": "At the begin g of marriages, we expect to be living on an eternal honeymoon, but the reality can be different.  This is a process of adaptation, even if you had known your better half for a long time, during the first months and years of marriage you go through a process of settling in your new roles and confront new challenges together that as you resolve become new rules and agreements.Yes, you can work this issues by practicing assertive communication, being clear with each other about what is the problem, how you feel about it and how would you like to resolve it.  Learn to close arguments with resolutions, and reminding that you care about each other, that’s why you choose to be together.  Discuss your roles and expectations, this is normally done over a marriage preparation class, is never too late to sit down a talk about what you want and look for in a husband/wife and clarify your roles and rules. Find couples therapist who mediates communication and helps both of to you learn assertive communication"}
{"input_text": "I am a really shy person. I'm currently in a graduate program which requires lots of presentations, but they always make me feel stressed out and less confident. How can I get more confident?", "output_text": "I can offer you hypnosis for confidence in presentations, via Skype, if you're in Cali."}
{"input_text": "He is in his late thirties and I am in my mid twenties. We have been together for about 5 months. I really like him. He says he cares about me and is willing to fight to make things right. He has been very apologetic and expressed he did it out of fear. I don't know if it's worth giving him a second chance.", "output_text": "Cheating is often a sign that something is amiss in the relationship. His fear may be full of information. While it's possible to repair relationships after a betrayal it's also challenging to do, especially so early in your relationship. I can't tell you if you should/shouldn't give this relationship a second chance but I will tell you to tune into your own intuition (and follow your own fears in doing so, they often are incredibly informative when we don't push them away with denial)."}
{"input_text": "He had a sexual relationship with his sister and kept it from me for years, I confronted about it and he finally told me what happened. But I dont think he is telling me the whole story. He works with her and sees her every day.    I feel that I shouldn't stay with him , but he says he ended it long time ago. Should I trust my husband and stay with him?", "output_text": "Trust is a necessary factor for an intimate relationship to feel safe.The person who must repair the trust is the one who has broken this trust.The best way to find out if your husband wants to restore your trust in him, is to ask him this question.  He may not be willing to meet your request.If he hesitates or becomes defensive about the need to restore your trust, then ask him to think his decision through and tell him the serious consequence you are considering.Ask him to reflect for a few days or a week and then to address the topic again.If you and he consistently find that he is unwilling to do anything at all to regain your trust, then I agree you have serious thinking to do as to whether or not you'd be able to live within a partnership based upon trust, in which you don't trust your partner."}
{"input_text": "My boyfriend is seeking therapy. He is in his 40s and has some childhood issues. He has kids from his previous ex-wife and is unable to see them.", "output_text": "Probably the more important questions to answer concern how much confidence you have in you and your boyfriend becoming parents, how you each feel about the influence of his being banned from seeing his current children, and be clear about the circumstances that led up to the decision of him not being permitted to see his kids.Don't allow some random professional to pronounce your boyfriend as cured.  A relatively qualified therapist would never make this call.Psychological and emotional tensions emerge from our relationships within families.  You and your boyfriend are in a position to set a strong foundation for having children, assuming each of you wants children.Childhood issues, your boyfriend's, anyone's, are more likely to go away when new patterns of interacting emerge.If the two of you are engaged in setting a secure relationship as future parents, the disappointments and hurt from the very early years, will be replaced by better ways of interacting."}
{"input_text": "My brother has been diagnosed with paranoid schizophrenia and has not been taking his medication. He's been using methamphetamine and alcohol and was found sleeping naked in my step mom driveway in 12 degree weather.\n   I was adopted in by his dad (who just passed) and his mother will not Get involved because she's afraid of financial responsibility.    Do I have the rights to be able to sign my brother into mentalhealth facility?", "output_text": "Family members sometimes get Power of Attorney over vulnerable adults. If you had this, you could do something like that. I'm assuming that you don't, though. There are steps family members can take through the court system to get someone involuntarily committed, but it is a long process. I deal with situations like this everyday on the job. The only time an adult can be committed against their will is if they are deemed by the doctor (such as at an emergency room) to be a threat to self or others. For instance, if he had suicidal thoughts and a plan to carry out the action, or if he had homicidal thoughts against someone else and a plan to carry it out, he could be placed on a short hold, but these holds only last for a few days. This still isn't a long-term solution. An adult has the right to refuse treatment and the right to make their own choices, no matter how bad those choices are. If you have a way to get him to an ER whenever things like that happen, such as being found sleeping outside in 12 degree w"}
{"input_text": "This is my recovery, and I don't feel that it is okay for them to ask this. They told me it is policy due to the fact that I may run into a peer there. I am a peer counselor in the small community that I grew up in. I am in recovery myself. I was asked to come work for this organization after I was two years sober (I was in treatment in this organization). I work with mental health peers and run life skill groups. I don't work with substance peers.", "output_text": "Hello, and thank you for your question. I know that workplaces have some latitude when it comes to requiring certain behaviors from their employees. For example, they may require you to tell them if you get into some kind of legal trouble. But this situation seems completely different. For one thing, 12 step meetings are supposed to be anonymous. I am not sure how they would know that you attended unless you or someone else told them. I agree that it seems like to cross a line. Usually each state has an office that manages complaints related to employment, such as the Department of Labor or EEOC. You may want to see which entity is in your state and contact them. It would be worth asking them to see if this is a legal practice. If it is but you still want/need to stay at this job, then you may want to look for alternate sources of support for your sobriety. There are active online support groups that would allow you to do things from the privacy of your home. SMART Recovery http://www.smartrecovery.org/ is a "}
{"input_text": "Ive been in an on an off relationship with a this man for almost 3 years. Even though I care about him, he continues to hurt me.    He and his wife were separated when we met. Now he's going through a really difficult divorce from her and is taking it really hard. I want to end this relationship, but I don't feel like I can. How can I let go?", "output_text": "First decide what you truly would like in the current relationship. Understand your reasons for staying in the relationship.Three years is a substantial amount of time to be involved with someone.   Whatever attachment you feel toward this man is deep and complex.Instead of deciding to leave or not leave, change your question to figuring out your satisfactions and dissatisfaction with the man. Also important is to tell the man your feelings.Whatever problem you are feeling may become clarified by discussing what bothers you.At the very least, you will give the guy a chance to show how interested he actually is in the tension you currently feel and have felt for a while."}
{"input_text": "My boyfriend of five months expresses how much he cares for me and loves me, and I believe it. It has been one of the best relationships I have been in for a short period of time, but he has lied to me so much. He’ll tell me that he'll stop lying, and while he’s saying that, he's hiding something or lying about something. First, it was about a girl. He hid text messages and claimed she was a friend and it was a friendly conversation when it was a girl he once found interest in. Next was his ex-girlfriend. He put a fake contact name, and it was just friendly, but he lied to my face. All the time, he claims he never cheated and still expresses his love the same way and that he wants to change and do better.", "output_text": "New York, New York...it's not your boyfriend's lying that concerns me the most; it's the lies you tell yourself. Verbal expressions are easy, but it's walking the walk that's more important in the end. When someone shows you what they're capable of, you can believe them. He's capable of being manipulative and deceitful, and he even lies as he's telling you he'll stop lying. What you're doing is called denial; when you see evidence of something but you choose not to believe the evidence. He might love you with his heart, but love, in the end, is a verb and is based on respectful, loving behaviours. My wish is that you start by believing in what you deserve."}
{"input_text": "I have so many issues to address. I have a history of sexual abuse, I’m a breast cancer survivor and I am a lifetime insomniac.    I have a long history of depression and I’m beginning to have anxiety. I have low self esteem but I’ve been happily married for almost 35 years.\n   I’ve never had counseling about any of this. Do I have too many issues to address in counseling?", "output_text": "Thank you for sharing your question.  I imagine it feels overwhelming and discouraging at times if you feel like there are too many issues to address in a counseling session.  I would encourage you to share these concerns with a counselor because a counselor can help you organize the concerns into a list of specific goals.  For example, a list of goals may look similar to this:1.  \"I will learn about the effects of medication on the symptoms of depression and anxiety.\"2.  \"I will learn about the factors that affect insomnia.\"3.  \"I will learn about resources and support groups in my local area to help me cope with my traumatic experiences.\"4.  \"I will practice self-care exercises each day and write about my thoughts and feelings in a journal so I can measure whether or not I\"m making progress.\"This is an example of some of the possible goals a counselor can help you work toward each week.  Working toward a specific goal can lead to a feeling of accomplishment once you've completed it, and this may have a posi"}
{"input_text": "I have a lot on my mind, but all I want to do is stay locked in my room and not socialize with anyone. Why do I feel so alone?", "output_text": "It has been said that depression is often the result of a blocked goal.  Often people struggle with both anxiety and depression but have difficulty determining which is the most important issue. For some, depression is the result of frequently blocked goals and when their predominant issues are evaluated, they discover that they are anxious (worried) about a lot of areas in their life but seem to find no relief.  When there is no relief and there have been numerous attempts (either in their mind or in practical application) to resolve the anxiety, depression is often the result.  In this type of case, depression is not the main or underlying issue. The anxiety is the underlying issue.  Having \"a lot on my mind\" sounds like anxiety. Unresolved anxiety can lead to feelings of depression which are often associated with \"emptiness.\"  In the question above, I would want to evaluate all of the issues surrounding having \"a lot on my mind\" and determine where these might be coming from. Has there been ongoing rejecti"}
{"input_text": "I am not sure if I am depressed. I don't know how to bring it up to my parents, and that makes me miserable.", "output_text": "You are not alone, many people fear opening up to family members about the topic of depression or mental illness. There are many different reason why some may fear telling their parents. The most common thoughts I hear in my office are: \" My parents won't understand me\", I may cause more problems to the family\", \"I am worried that something bad may happen if I tell them\". If possible express your current concerns and worries to your parents. You can start the conversation with your parents by saying \"I have not been feeling like myself lately, and I may want to see a counselor\". I think you are doing the right thing by going on this website and asking for help. Just a helpful tip: positive self-talk can be beneficial before having difficult conversations with others. For example, tell yourself something positive before talking to your parents such as \"I feel confident in myself, and I am doing this to overcome my fear of talking to my parents\" can help to decrease the anxiety you are feeling leading up to the"}
{"input_text": "I have PTSD. The side effects are really bad and have impacts on sex, anger and my relationships. I even lost my job month ago.    How can I get my life back?", "output_text": "Your feeling overwhelmed by emotion and finding it difficult to trust people.  This can be a really scary feeling.  It is a common reaction for individuals who have endured a traumatic experience.  Often, the aftermath of a trauma can leave people feeling constantly on guard, panicky, depressed, isolated, and riddled with nightmares and intrusive thoughts of the incident.  And while the signs and symptoms can feel complex and at times overwhelming, feeling better is more than possible.  Give yourself credit for the courage that it takes to reach out.  With trauma therapy, I would expect you will begin feeling better as we implement a compassionate and client-focused evidenced -based approach together. I've helped countless people to gain positive ground over their traumatic experiences in a safe, supportive environment.  I offer a variety of evidenced based traditional therapies as well as holistic modalities to best support you on the path to healing.  We will work together as allies in your treatment.  It w"}
{"input_text": "I have so many issues to address. I have a history of sexual abuse, I’m a breast cancer survivor and I am a lifetime insomniac.    I have a long history of depression and I’m beginning to have anxiety. I have low self esteem but I’ve been happily married for almost 35 years.\n   I’ve never had counseling about any of this. Do I have too many issues to address in counseling?", "output_text": "There is no such thing as too many issues for counseling. Many issues are often interrelated and can all be worked on with some time and patience."}
{"input_text": "My father is in the hospital and was diagnosed with leukemia. I have been dealing with that all day. My husband keeps getting mad at me for things that I said.", "output_text": "I don't know how long you have been married, but this might be a time to explain to your husband what you wish he could do for you in this moment. It could be that he is showing that he is getting mad at you because he is worried about you and it is just coming out wrong. Maybe he would be open to an honest discussion?"}
{"input_text": "How does a person start the counseling process?", "output_text": "The easiest way to start the counseling process is to do a little research online. A quick search for the type of counseling you are looking for can be helpful. There are lots of Counselors out there to choose from, so many times you will have to take it a few steps further than that. Check out their website, social media, and any reviews (but remember, people are not always very nice). If you plan on using insurance to pay for at least part of the services, look for one that is in your network. You can find out if someone is in your network by looking for providers on your insurance's website. If your coverage isn't that great and you know you're going to be paying for it all anyway (because you're an all-star and verified your coverage already with the insurance company), then you can really pick any Counselor you want, but working with one that is at least out of network will give you the benefit of having it applied to your deductible. If you have any questions about that process or just want some help in"}
{"input_text": "I never feel like myself. I can’t even think straight anymore. I start stuttering and I can’t remember anything. I always get nervous and usually talk myself down but recently end up fighting with, what feels like, someone else. I don’t know why I feel this way, but I hate it.", "output_text": "Hello,I am wondering if you might be experiencing some form of dissociation.  People who dissociate might feel like the world around them is unreal and unfamiliar, or that they are not really in their bodies and that they are observing themselves from outside of their bodies.  Dissociation can also mean that there are parts of you that have \"split off\" and sometimes parts are can feel like they are at odds with each other or are locked in conflict.  Sometimes dissociation happens after someone experiences a trauma.  Therapy can help you to understand what is going on and help you to integrate your experiences and ultimately heal.I am a therapist in Houston who specializes in dissociation.  On my website I have information specific to dissociation that might be helpful to you. Sarah"}
{"input_text": "How does a person start the counseling process?", "output_text": "Most counselors are very approachable and many offer a 15 minute chat by phone to allow you to talk about your issue, and to get a feel for the counselor.  If you like what you hear by phone, the next step is to set up a face-to-face meeting. Studies show that the most important element in effective therapy is that you feel a connection with your counselor.  Trust your instincts and if you don't feel comfortable, let him or her know that you don't think it's a good fit.  Many counselors list on websites like Psychology Today and Good Therapy.  Visit these websites to learn more about therapists in your area."}
{"input_text": "I am so terrified of having sex anymore because I have been told over and over that sex is dangerous even though me and my partner used both forms of protection. My partner is not happy about this and simply wants more sex, and honestly, I want to give that to her.", "output_text": "I am wondering who is telling you that sex is dangerous.  Is this medical advice, or is this someone’s\nopinion trying to scare you from having sex? \nAnd if so, how old are you? Is it ok to have sex, do you want to have\nsex?  It sounds like you want to make\nyour partner happy, and that you are taking care of protecting yourself and\nyour partner, but maybe you are forgetting to consider what do you really want.  Having sexual relations is a very personal decision;\nyou and your partner have to consent.  It\nis also important to talk about the possible consequences and being responsible\nfor them as well.  But sex should be something\nthat you enjoy, not that you should be fearful of.  A therapist can help you to process those\nnegative thoughts and feelings that may impair you from enjoying your sexual\nlife. ¿Cómo puedo superar mi miedo de un\nembarazo no deseado y poder tener sexo otra vez?Estoy\naterrorizado de tener sexo porque me han dicho una y otra vez que el sexo es\npeligroso, inclusive cuando yo y mi pareja us"}
{"input_text": "I've been married for 3 years and I have two kids. During my 3-years married, my husband cheated on me twice. The second time really got to me and at my lowest I hurt him back. We aren't communicating as well as I would like. What do I do?", "output_text": "Hi there. Thank you reaching out for help. It takes a lot of courage for someone that is being abused to reach out for help. I want you to know that I am here to help you in any way that I can. First and foremost, you did not mention whether or not you had children yourself by this man. I’m going to assume there are. So, the most important thing right at this moment is asking yourself, if you and your children are safe? Is the boyfriend currently living in the home or is he coming and going? If he is coming and going or currently living in the home, my suggestion for you to is to pack a bag for you and your children and go somewhere safe (i.e. family members home, friend or a shelter temporarily). I cannot stress this enough. Although, some people tend to minimize their abusers behavior (i.e. they only do it when they are drinking, they only do it when they are mad), it’s those individuals that find themselves or their children in a serious situation. So, you can never take abuse (physical or mental) lightly "}
{"input_text": "My friend is abusing her prescription medicine. Even though she told me she didn't have any more pills, I found she has prescriptions for anxiety medications.", "output_text": "Your good intentions to help your friend stay clean, are very caring about her.Unless your friend feels like stopping pills,  taking them away will mean she finds them some place else.The problem that anyone who is addicted to pills has, is that the person is psychologically and at least with xanax, physically addicted.Taking pills has basically become a standard part of your friend's life.Her problem is bigger than your ability to care.If you haven't already done so, tell your friend directly about your opinion on the way she is using pills.This is not a guarantee that she'll stop.It isa way of you showing that you care about her.Offering love and advice are the only things you can do for her.Meanwhile, knowing she is hurting herself is probably hurting you.Be sure to keep a sense of balance within yourself.  Offer your concern and know she is the one who must decide to stop using."}
{"input_text": "I just got married with my husband. I have four kids of my own, and he accepts me with my kids. I am thankful he loves my kids even though they’re not his. Now we are having problems in our relationship because of my past. I know all marriages have problems, but sometimes I feel it’s not going to work out if there’s no trust. It’s hard for me to let go because I love him, but I am getting tired.", "output_text": "Hi Louisiana,You say that the problems are with your \"past\", but my hunch is the problems are about his insecurity and his personal barriers to trust (unless you've recently revealed details of a sordid past?). You don't mention ever having hurt the trust in the relationship.Trust is the first stage in a relationship. Moving forward before they develop trust is a common mistake couples make, and now you two have involved children in a relationship that's missing a crucial element. But you didn't see this coming, did you? That's because only as we become emotionally intimate do our deeper fears and insecurities come to the surface. I give you credit for wanting it to work, and I believe you would benefit from the support of a therapist in working through the kinks related to trust. Good luck!"}
{"input_text": "I met a guy a while ago, and I can't stop thinking about him. I feel like I love him, but I don't think I know him. What if he is not who I think he is? I cry sometimes thinking someone is going to be with him or that he has a girlfriend. I don't know, am I too obsessive? Every time we talk though, it's like magic. He makes me feel amazing, but what if I'm mistaken?", "output_text": "Keller, it sounds like you're living this relationship in your mind, instead of in the real world. You can get answers to your questions by talking to him...getting to know him will answer all the curiosities you have. You're asking the questions in your head instead of being in the friendship. So what is it that gets in the way of actually asking the questions and getting to know him? Fear of rejection? Fear of something else? If you have fear that keeps you from having fulfilling friendships, I recommend a therapist to help you work through that. I wish you well. :)"}
{"input_text": "I am extremely possessive in my relationships and this is hurting my friendships. How can I fix my underlying issues?", "output_text": "Hi there. It's great you are able to realize there are other issues going on with someone who feels possessive. At the root of it is fear. Fear of losing someone, fear of being alone, fear of not being good enough. All those fears can lead to low self-esteem and feeling like you have to control other people so you don't lose them. The thing is, controlling other people only pushes them away. Vicious circle, right? What I would suggest is some cognitive therapy to change those underlying ways of thinking. You can start with this assignment. Write down all the things you think about yourself, positive and not-so-positive. Then rewrite those not-so-positive things so they are positive. For example, thinking something like, \"I'm too pushy\", can be rewritten as, \"I'm assertive and I go after what I want.\" It can be hard to do since we tend to get \"stuck\" in our negative ways of thinking about ourselves. If you have someone you trust, you can ask for their help as well since most likely they see you differently tha"}
{"input_text": "How do you know you have the right therapist for you?\n How would I know how to \"train\" my therapist to be able to give me what I need from treatment?", "output_text": "You will know you have the right therapist when you feel at ease and comfortable to share deep feelings.You do not hold back and feel total acceptance and validation by your therapist. Listen to your feelings and letthem guide your decision.Your therapist and you will work together to decide what is best for you with regards to the type of treatment, frequency andduration. It is about collaborating and deciding together on the treatment plan that will help you to achieve your counseling goals."}
{"input_text": "I don't know what's with me. I'm almost constantly angry. Even when I'm happy, I still feel anger inside me. When I acknowledge it, it ruins my mood and takes over. I get angry at the littlest things. Even if I think someone said something they didn't, it infuriates me. Something perfectly normal can make me go off. When my anger flares up, I get a terrible pain in my chest that lasts for a while. It's like there is a fire constantly burning in my body, and anger is gasoline.", "output_text": "Hi Nashville, I'm glad you want this to be different. It doesn't feel good to be angry all the time, and it's stealing your energy as well as affecting relationships, I'm sure.Working with a therapist, you can learn to recognise the deep emotions that lie underneath the anger. It's likely to be either powerlessness or worthlessness, and what happens is this... a small moment in the present touches on an old, tender, bruised emotion that we've simply felt too much of or too strongly in the past. We develop ways of avoiding these vulnerable emotions, and anger is one way of doing that. So, when someone looks at you in a certain way, or says something, you'd rather be angry than feel powerless, or unimportant (or whatever your kryptonite feeling is). In that moment, your instinct is to blame whatever happened, no matter how small, because that's the thing that happened just before you got mad. You fail to recognise that the problem is not the look on that person's face, or the shoe that someone left in front of "}
{"input_text": "I feel so alone. I have so many people around me, but it seems as they just listen and dont understand. They say it will all be okay, or they don't listen to me st all. Everyone says they are here for me but it doesn't feel like they are. Why do I feel so alone?", "output_text": "We feel alone because we are not comfortable with being our self. When you find that nobody is around do you feel alone? Your never alone. Once you take the journey to really understand who you are and unconditionally loving all that is you, there will never be an alone moment. We seek outside of self to fill inside. This is the big lie of the planet. All you need and have ever needed you supply yourself. www.lifecounselingorlando.com"}
{"input_text": "I'm feeling rejected and frustrated. This is not new. The first month we were together, sex was about every day. Then it slowed down to once a month right away. I love my husband, but I am struggling with this.", "output_text": "Have you said anything to your husband about the way you're feeling?Start with this.Sex is after all, a two person enterprise.If he would like to talk about the way you're feeling, great and wonderful.  The two of you already are continuing to grow trust in your communication and relationship.If he doesn't want to talk about how you're feeling, then you're facing a different problemYour feelings are real and need to be handled.If you end up facing your feelings of frustration about your husband not wanting to have sex with you, on your own, then does your husband give you a truthful sounding reason as to why not?Ask what explains his disinterest in having sex with you.If he doesn't want to address this question, then you are a little further down the rung of trust and care about you.Depending on how satisfied you are with his answers, will guide you on how much dissatisfaction you can live with and why, longterm."}
{"input_text": "I loved him more than anything. He passed away on our anniversary which was also the day I was going to apply for our apartment. I'm not handling it well. I moved to a new town and started a new life but nothing helps.", "output_text": "I am so sorry to hear of your boyfriend's passing. Grief is something that can take a long time to recover from. Have you considered speaking with a grief counselor? Being able to speak with someone that specializes in grief would be very beneficial. Do not get down on yourself for not recovering quickly. This is one of the hardest aspects to deal with in life but eventually you will be able to move forward. In the mean time, immerse yourself with positivity (i.e. Good friends, hobbies, exercise) and try to schedule a time with a counselor. Perhaps there will be a support group you could also join. Oftentimes, it is comforting to meet others who share the same experience as you.Good luck to you. I hope you will find peace and comfort soon."}
{"input_text": "I have terrible anxiety and depression. I've tried various therapists and pills, but nothing's helped.", "output_text": "Is it possible you simply didn't mix well with the particular therapists with whom you've worked?   If this is possible, interview a therapist before  starting therapy.   Then you will be choosing a therapist who feels compatible with your way of seeing yourself and your life.Also, therapy isn't for everyone.Read about the different healing modalities and see if one of these speaks to your interest in feeling better.What matters most is finding among all the legitimate healing methods, what you believe will be effective."}
{"input_text": "I was the one who ended it, and I'm so glad I did. It was the best decision I made in my life. But how do I stop the nightmares and flashbacks? It is creating a wall in my current relationship.", "output_text": "It sounds like you have not had the opportunity to process through the trauma you have endured. It would help if you have the opportunity to speak with someone on a regular basis until the symptoms of your trauma have subsided."}
{"input_text": "I've gone to a couple therapy sessions so far and still everytime I walk in I get nervous and shaky. Is this normal? Should I still be feeling like this?", "output_text": "It’s very normal to be nervous going into therapy. You are being vulnerable and honest, which is always scary, no matter how many times you do it. The best part about therapy is that the more you go, the more confident you are in your ability to work through those difficult feelings, and while you still may sometimes get nervous, you will have confidence too!"}
{"input_text": "After he got home from the hospital he was angry, then for a time wonderful. Now he is depressed and hopeless again.", "output_text": "Hello, and thank you for your question. This is a very serious time. I don't mean to frighten you, but you are right to be concerned. The time right after people leave the hospital after receiving psychiatric services is a time of high risk for suicide. It is very important, after hospitalization, to get follow-up care with a professional as soon as possible. If your husband has an established therapist, this is the time to call. It is also a good time to alert your support system of friends, family, clergy or others to let them know he is still struggling. This is good support for him AND you.It is important to think about means and opportunity to make another attempt. Means really do matter.  So, if you have a firearm in the home, it is really important to remove it. You can't remove all things that a person may hurt themselves with, but some things are more lethal than others. Firearms are very lethal. I am not sure what means he used last time, but try to reduce the opportunity for him to access it again."}
{"input_text": "I have bipolar II disorder, I'm addicted to alcohol and weed, and I'm hopeless. I keep drinking even though it's harming myself and others.", "output_text": "This relationship with your step dad sounds very challenging. It is hard to to be told over and over again how not good enough we are. Let me offer you this, frequently when we say harsh, mean, nasty things to others, we are simply projecting our own thoughts about ourself. I am not advocating that this is ok, it seems like your stepdad could also use some support. You get to make your own empowered choice around this, this is your life and if you find yourself in a situation that does not suit you make a change."}
{"input_text": "I used to be the funny guy of the group—the class clown, if you will. I used to laugh uncontrollably all the time and be able to be social without it feeling awkward. Now I can't laugh at all, and I'm dead inside.", "output_text": "If you look back to when you feel as though you were the \"funny guy,\" I wonder what is different now? It may be that responsibilities have changed or any number of other things.I don't know whether you're also saying that you feel sad or if you're saying that you feel as though you don't have any big changes in your feelings.A lot of us tend to be really busy, and sometimes we over schedule ourselves to the point that we don't have time to have positive time for ourselves. Sometimes even if we are spending time with friends, we're thinking about work and all of the other things we need to do.I wonder if it feels awkward when you're with friends that you trust in an environment that you are used to. Maybe if that is more comfortable for you, it can be a stepping stone to focusing on how you feel better in those moments.It sounds as if you may have had an experience (or more than one) where you felt misunderstood or criticized and now reacting to people feels awkward. If so, try going back to people you trust. "}
{"input_text": "Is it normal for people to cry during therapy, or is it just me?", "output_text": "Crying in therapy is a natural response, a relief to what you are going through. It is an expression of emotions, which is why you are going to therapy - to express yourself in a safe, nonjudgmental space. Rather than trying to stop crying, sit on the couch with it until it is done and you have finished with the clearing. The energy is not blocked, is moving - a good thing. It's good to cry."}
{"input_text": "I easily recognize this but have no control over it and need suggestions for managing my anger.", "output_text": "I suggest that you work on emotional awareness. Emotional awareness basically means knowing what you are feeling and why.Emotional awareness also means that you can identify the link between the way you are feeling and your actions. In other words knowing that your feelings dictate what you do.Often feelings of hurt or insecurity can come out as anger if we cannot properly identify and express the feelings.Being emotionally aware also means that you are able to express your feelings to others. Being unable to do so leads to feelings of frustration and being misunderstood.Many people for many different reasons are not in touch with their emotions. For example, men traditionally have been brought up taught to not express sadness or weakness. Therefore, many men learned to turn feelings of sadness, insecurities, or fears into anger and express these feelings as anger. Being taught not to feel a certain emotion does not make that emotion disappear. Instead it makes us learn how to express it in other, incorrect, "}
{"input_text": "I’m facing severe depression and anxiety and I just feel like I’m going through a lot. This really distracts me and I cant get my mind off the things that are bothering me.    How do I overcome this anxierty and depression?", "output_text": "Have you used meditation or hypnosis? Relaxing the mind and connecting with your true self is a great way to calm your thoughts and get to peace and calm. Hypnosis and meditation have helped a lot of people with anxiety and depression. Google hypnotherapists near me or write for a while about what is going on."}
{"input_text": "I've pretty much been on my own since day one, I'm a middle child of five, and I can't seem to put my trust in anyone. It took me four years to finally open up a little to my best friend. Every time I realize that I have feelings for someone, I freak out and never talk to them again. I really want some help.", "output_text": "One way to concentrate is that if your mind starts to wonder then remind yourself to bring your attention back.Start with short time spans of expecting yourself to concentrate.  You'll more likely succeed with concentrating with small time spans than longer ones.Once you start seeing your success, this will motivate you to try increasing the length to expect yourself to concentrate.The task of self-reminding is the same, whether for long or short time periods.Also, before starting this exercise ask your medical doctor if the problem can be related to a physical health problem.If there is, then have the possibility ruled out that your difficulty concentrating comes from the mental ability to concentrate, and not some medical reason preventing this.Before someone can engage their psychological will there must be a clean medical body and mind with which to work."}
